-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\\logs\3_2_regression_decomposititon.log
  log type:  text
 opened on:  20 Feb 2017, 14:56:21
r; t=0.03 14:56:21

. use $git\data\bibb_99_06_12.dta , clear
r; t=0.03 14:56:21

. ****************************************************************************************************
. ****************************************************************************************************
. numlabel , add
r; t=0.03 14:56:21

. tab bibb

survey year |      Freq.     Percent        Cum.
------------+-----------------------------------
    0. 1999 |      7,679       47.72       47.72
    1. 2006 |      4,593       28.54       76.27
    2. 2012 |      3,819       23.73      100.00
------------+-----------------------------------
      Total |     16,091      100.00
r; t=0.02 14:56:21

. * Regressions:
. *** 2006:
. ml model lf myestimator (mu: lhw = (b2.skilllevel)##(c.zpalter##c.zpalter) ///          
>                                 b13.occupational_categories index_afl_1 - index_afl_4 njc sjc pcuse) ///
>                                 (lnsigma:  c.zpalter##c.zpalter b2.skilllevel ///
>                                 index_afl_1 - index_afl_4 njc sjc pcuse ) ///
>                 if cond==1 &bibb==1  [pw=gew]
r; t=0.16 14:56:21

. ml maximize

initial:       log pseudolikelihood =  -56364532
alternative:   log pseudolikelihood =  -27156842
rescale:       log pseudolikelihood =  -22817089
rescale eq:    log pseudolikelihood =  -15777183
Iteration 0:   log pseudolikelihood =  -15777183  (not concave)
Iteration 1:   log pseudolikelihood =  -10496158  (not concave)
Iteration 2:   log pseudolikelihood = -8354071.8  
Iteration 3:   log pseudolikelihood = -7833975.8  
Iteration 4:   log pseudolikelihood = -7798264.3  
Iteration 5:   log pseudolikelihood =   -7798203  
Iteration 6:   log pseudolikelihood =   -7798203  

                                                  Number of obs   =       4178
                                                  Wald chi2(34)   =    1056.73
Log pseudolikelihood =   -7798203                 Prob > chi2     =     0.0000

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                               |               Robust
                                                                                                           lhw |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------------------------------------------------------------------------------------------------+----------------------------------------------------------------
mu                                                                                                             |
                                                                                                    skilllevel |
                                                                                                       1. low  |  -2.657388   1.506149    -1.76   0.078    -5.609387    .2946099
                                                                                                      3. high  |  -1.649132   .4818071    -3.42   0.001    -2.593457   -.7048075
                                                                                                               |
                                                                                                       zpalter |   .0462391    .011772     3.93   0.000     .0231664    .0693118
                                                                                                               |
                                                                                           c.zpalter#c.zpalter |  -.0004503   .0001442    -3.12   0.002     -.000733   -.0001676
                                                                                                               |
                                                                                          skilllevel#c.zpalter |
                                                                                                       1. low  |   .1506119   .0791075     1.90   0.057     -.004436    .3056598
                                                                                                      3. high  |   .0802206   .0240553     3.33   0.001     .0330731     .127368
                                                                                                               |
                                                                                skilllevel#c.zpalter#c.zpalter |
                                                                                                       1. low  |  -.0020984   .0009987    -2.10   0.036    -.0040557   -.0001411
                                                                                                      3. high  |  -.0008676   .0002932    -2.96   0.003    -.0014423    -.000293
                                                                                                               |
                                                                                       occupational_categories |
                                                                                     1. Agriculture, Forestry  |   .0251459   .0918539     0.27   0.784    -.1548844    .2051762
                                                     2. Mining, Mineral winning, Stonery, Material production  |   .1789677   .1051515     1.70   0.089    -.0271255     .385061
                                                                                         3. Chemical industry  |   .2453532   .0985071     2.49   0.013     .0522829    .4384235
                                          4. Paper manufacturing, paper converting, printing, wood processing  |   .2141561   .0957295     2.24   0.025     .0265297    .4017826
                                                                                     5. Metalworking industry  |   .1667307   .0684501     2.44   0.015     .0325709    .3008905
                                                                            6. Metal-structuring, engineering  |   .1601922   .0575701     2.78   0.005     .0473568    .2730276
                                                                                   7.  Electrical engineering  |   .1105004   .0610483     1.81   0.070    -.0091521    .2301529
                                                       8. Apparel industry, leather production and processing  |  -.0966927   .1689109    -0.57   0.567     -.427752    .2343667
                                                                                             9. food industry  |  -.0501243   .0652161    -0.77   0.442    -.1779457     .077697
                                                                         10. Structural and civil engineering  |   .0597154   .0813686     0.73   0.463    -.0997641    .2191948
                                                                                     11. Lining, upholstering  |   .1581357   .0951621     1.66   0.097    -.0283787      .34465
                                                                             12. Wood- and plastic processing  |   .0792105   .1004972     0.79   0.431    -.1177603    .2761814
                                                                      14. Chemists, Physicist, Mathematicians  |   .3176034   .0615513     5.16   0.000     .1969651    .4382416
                                                                                      15. Technical engineers  |   .2305788   .0587729     3.92   0.000      .115386    .3457715
                                                                                                16. Merchants  |   .1532825   .0693158     2.21   0.027     .0174259     .289139
                                                                                        17. Service merchants  |   .3413335   .0647097     5.27   0.000     .2145048    .4681622
                                                                                         18. Transport sector  |  -.0319252   .0619817    -0.52   0.607    -.1534071    .0895567
                                                                             19. Organisation, Administration  |    .267006   .0584562     4.57   0.000     .1524341     .381578
20. Occupation of order and security, Artist, Health Service, Social and educational occ., other service occ.  |   .0660201   .0596615     1.11   0.268    -.0509143    .1829546
                                                                                                               |
                                                                                                   index_afl_1 |   .2243856   .0683872     3.28   0.001     .0903491    .3584222
                                                                                                   index_afl_2 |   .2230252   .0650535     3.43   0.001     .0955226    .3505278
                                                                                                   index_afl_3 |   .0114414   .0793418     0.14   0.885    -.1440656    .1669484
                                                                                                   index_afl_4 |   .1477848   .0664957     2.22   0.026     .0174556    .2781139
                                                                                                           njc |   .0077184   .0050041     1.54   0.123    -.0020895    .0175262
                                                                                                           sjc |   .0191857   .0073521     2.61   0.009     .0047758    .0335957
                                                                                                         pcuse |   .1424529    .023966     5.94   0.000     .0954804    .1894254
                                                                                                         _cons |   1.247037   .2437847     5.12   0.000      .769228    1.724846
---------------------------------------------------------------------------------------------------------------+----------------------------------------------------------------
lnsigma                                                                                                        |
                                                                                                       zpalter |  -.0158728   .0218134    -0.73   0.467    -.0586262    .0268807
                                                                                                               |
                                                                                           c.zpalter#c.zpalter |   .0001903   .0002676     0.71   0.477    -.0003342    .0007148
                                                                                                               |
                                                                                                    skilllevel |
                                                                                                       1. low  |  -.0129981   .1389276    -0.09   0.925    -.2852912     .259295
                                                                                                      3. high  |  -.0099431   .0503719    -0.20   0.844    -.1086701    .0887839
                                                                                                               |
                                                                                                   index_afl_1 |  -.2534481   .1887875    -1.34   0.179    -.6234647    .1165685
                                                                                                   index_afl_2 |  -.1633474   .1667704    -0.98   0.327    -.4902113    .1635165
                                                                                                   index_afl_3 |   -.283806   .1988778    -1.43   0.154    -.6735994    .1059873
                                                                                                   index_afl_4 |  -.2323009   .2021764    -1.15   0.251    -.6285593    .1639575
                                                                                                           njc |    .007089   .0116267     0.61   0.542    -.0156989    .0298768
                                                                                                           sjc |  -.0495279   .0174398    -2.84   0.005    -.0837093   -.0153465
                                                                                                         pcuse |  -.0407638   .0498242    -0.82   0.413    -.1384174    .0568898
                                                                                                         _cons |   -.168008   .4375054    -0.38   0.701    -1.025503    .6894868
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
r; t=2.08 14:56:24

. est store reg2006
r; t=0.02 14:56:24

. mat b06 = e(b)
r; t=0.00 14:56:24

. mat b2006 = e(b)
r; t=0.00 14:56:24

. ****************************************************************************************************
. * predict beta and sigma by hand 
. matrix gamma06 =  b06[1,40..52]
r; t=0.00 14:56:24

. cap drop xb06
r; t=0.00 14:56:24

. gen xb06 = b06[1,1]* lowskill + b06[1,3]  * highskill + b06[1,4]  * zpalter ///
>  + b06[1,5] * zpalter_sq + b06[1,6] * lowskill * zpalter + b06[1,8]  * highskill * zpalter  ///
> + b06[1,9]  * lowskill * zpalter_sq + b06[1,11] * highskill * zpalter_sq + b06[1,12] * occ1       ///
> + 0     + b06[1,13] * occ2       + b06[1,14] * occ3  + b06[1,15] * occ4 + b06[1,16] * occ5   ///
> + b06[1,17] * occ6         + b06[1,18] * occ7  + b06[1,19] * occ8 + b06[1,20] * occ9 + b06[1,21] * occ10 /// 
> + b06[1,22] * occ11 + b06[1,23] * occ12 + b06[1,25] * occ14  + b06[1,26] * occ15 + b06[1,27] * occ16 ///
> + b06[1,28] * occ17 + b06[1,29] * occ18  + b06[1,30] * occ19  + b06[1,31] * occ20  ///
> + b06[1,32] * index_afl_1 + b06[1,33] * index_afl_2 + b06[1,34] *index_afl_3 + b06[1,35] * index_afl_4 /// 
> + b06[1,36] * njc + b06[1,37] * sjc  + b06[1,38] * pcuse + b06[1,39] if e(sample)
(11913 missing values generated)
r; t=0.00 14:56:24

. **
. cap drop sigma06
r; t=0.00 14:56:24

. gen sigma06 = exp( gamma06[1,1] * zpalter + gamma06[1,2] * zpalter_sq + gamma06[1,3] *lowskill ///
> + gamma06[1,5] * highskill + gamma06[1,6] * index_afl_1 + gamma06[1,7] * index_afl_2  ///
> + gamma06[1,8] * index_afl_3 + gamma06[1,9] * index_afl_4 + gamma06[1,10] * njc      ///
> + gamma06[1,11] * sjc + gamma06[1,12] * pcuse + gamma06[1,13] ) if e(sample)
(11913 missing values generated)
r; t=0.02 14:56:24

. predict lhw2006 if e(sample), xb        // *Default
(11913 missing values generated)
r; t=0.02 14:56:24

. compare lhw2006 xb06 // correct predition by hand?

                                        ---------- difference ----------
                            count       minimum      average     maximum
------------------------------------------------------------------------
lhw2006=xb06                 4178
                       ----------
jointly defined              4178             0            0           0
jointly missing             11913
                       ----------
total                       16091
r; t=0.05 14:56:24

. ****************************************************************************************************
. *** 2012
. ml model lf myestimator (mu: lhw = (b2.skilllevel)##(c.zpalter##c.zpalter) ///
>                         b13.occupational_categories index_afl_1 - index_afl_4 njc sjc pcuse) ///
>                         (lnsigma:  c.zpalter##c.zpalter b2.skilllevel index_afl_1 - index_afl_4 ///
>                         njc sjc pcuse ) ///
>         if cond==1 &bibb2012==1  [pw=gew]
r; t=0.14 14:56:24

. ml maximize

initial:       log pseudolikelihood =  -57770091
alternative:   log pseudolikelihood =  -27392694
rescale:       log pseudolikelihood =  -22446873
rescale eq:    log pseudolikelihood =  -16234158
Iteration 0:   log pseudolikelihood =  -16234158  (not concave)
Iteration 1:   log pseudolikelihood =  -10985713  
Iteration 2:   log pseudolikelihood = -8889768.1  
Iteration 3:   log pseudolikelihood = -8726551.8  
Iteration 4:   log pseudolikelihood = -8363513.6  
Iteration 5:   log pseudolikelihood = -8359789.2  
Iteration 6:   log pseudolikelihood = -8359772.5  
Iteration 7:   log pseudolikelihood = -8359772.5  

                                                  Number of obs   =       3452
                                                  Wald chi2(34)   =     759.62
Log pseudolikelihood = -8359772.5                 Prob > chi2     =     0.0000

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                               |               Robust
                                                                                                           lhw |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------------------------------------------------------------------------------------------------+----------------------------------------------------------------
mu                                                                                                             |
                                                                                                    skilllevel |
                                                                                                       1. low  |    -1.7441   1.364898    -1.28   0.201     -4.41925    .9310504
                                                                                                      3. high  |  -.4172972   .5951297    -0.70   0.483     -1.58373    .7491356
                                                                                                               |
                                                                                                       zpalter |   .0608167    .013271     4.58   0.000      .034806    .0868275
                                                                                                               |
                                                                                           c.zpalter#c.zpalter |  -.0006009   .0001623    -3.70   0.000    -.0009191   -.0002827
                                                                                                               |
                                                                                          skilllevel#c.zpalter |
                                                                                                       1. low  |   .0718561   .0689667     1.04   0.297    -.0633161    .2070282
                                                                                                      3. high  |   .0235869   .0302583     0.78   0.436    -.0357183    .0828921
                                                                                                               |
                                                                                skilllevel#c.zpalter#c.zpalter |
                                                                                                       1. low  |  -.0007584   .0008319    -0.91   0.362    -.0023889    .0008721
                                                                                                      3. high  |  -.0001927   .0003737    -0.52   0.606    -.0009252    .0005398
                                                                                                               |
                                                                                       occupational_categories |
                                                                                     1. Agriculture, Forestry  |  -.0857581   .1034639    -0.83   0.407    -.2885436    .1170274
                                                     2. Mining, Mineral winning, Stonery, Material production  |  -.0563317   .2026123    -0.28   0.781    -.4534444     .340781
                                                                                         3. Chemical industry  |   .1253846   .0922425     1.36   0.174    -.0554075    .3061766
                                          4. Paper manufacturing, paper converting, printing, wood processing  |    .187073   .1552052     1.21   0.228    -.1171237    .4912697
                                                                                     5. Metalworking industry  |   .1086728   .0880644     1.23   0.217    -.0639304    .2812759
                                                                            6. Metal-structuring, engineering  |   .1433013   .0777722     1.84   0.065    -.0091294     .295732
                                                                                   7.  Electrical engineering  |   .0896098    .081797     1.10   0.273    -.0707093     .249929
                                                       8. Apparel industry, leather production and processing  |   -.082227    .115856    -0.71   0.478    -.3093006    .1448465
                                                                                             9. food industry  |  -.1172525   .0885671    -1.32   0.186    -.2908408    .0563359
                                                                         10. Structural and civil engineering  |   .0958431   .1035704     0.93   0.355    -.1071511    .2988374
                                                                                     11. Lining, upholstering  |    .109005   .1067483     1.02   0.307    -.1002177    .3182278
                                                                             12. Wood- and plastic processing  |  -.1195153   .0868131    -1.38   0.169    -.2896659    .0506353
                                                                      14. Chemists, Physicist, Mathematicians  |   .3289365   .0867224     3.79   0.000     .1589637    .4989092
                                                                                      15. Technical engineers  |   .1601394   .0767504     2.09   0.037     .0097114    .3105673
                                                                                                16. Merchants  |   .1058765   .0903912     1.17   0.241     -.071287    .2830399
                                                                                        17. Service merchants  |   .1698319   .0877047     1.94   0.053    -.0020662      .34173
                                                                                         18. Transport sector  |  -.1568028   .0810636    -1.93   0.053    -.3156845    .0020789
                                                                             19. Organisation, Administration  |   .1902005   .0775556     2.45   0.014     .0381943    .3422068
20. Occupation of order and security, Artist, Health Service, Social and educational occ., other service occ.  |   .0107675   .0763552     0.14   0.888     -.138886     .160421
                                                                                                               |
                                                                                                   index_afl_1 |   .2451409   .0773523     3.17   0.002     .0935332    .3967486
                                                                                                   index_afl_2 |   .1645214   .0639434     2.57   0.010     .0391947    .2898481
                                                                                                   index_afl_3 |    .004642   .0768371     0.06   0.952     -.145956      .15524
                                                                                                   index_afl_4 |   .1454645   .0722542     2.01   0.044     .0038487    .2870802
                                                                                                           njc |   .0082283   .0062258     1.32   0.186    -.0039741    .0204307
                                                                                                           sjc |   .0273689   .0085247     3.21   0.001     .0106607     .044077
                                                                                                         pcuse |   .1457286   .0302496     4.82   0.000     .0864404    .2050168
                                                                                                         _cons |   1.032431   .2717214     3.80   0.000     .4998664    1.564995
---------------------------------------------------------------------------------------------------------------+----------------------------------------------------------------
lnsigma                                                                                                        |
                                                                                                       zpalter |   .0286303   .0290799     0.98   0.325    -.0283653    .0856259
                                                                                                               |
                                                                                           c.zpalter#c.zpalter |  -.0002721   .0003539    -0.77   0.442    -.0009657    .0004216
                                                                                                               |
                                                                                                    skilllevel |
                                                                                                       1. low  |  -.0372936   .1195059    -0.31   0.755    -.2715208    .1969336
                                                                                                      3. high  |   .0605123   .0828284     0.73   0.465    -.1018284    .2228531
                                                                                                               |
                                                                                                   index_afl_1 |   .1140989   .1543347     0.74   0.460    -.1883916    .4165894
                                                                                                   index_afl_2 |  -.0005343   .1284612    -0.00   0.997    -.2523137    .2512451
                                                                                                   index_afl_3 |   -.050183   .1631349    -0.31   0.758    -.3699216    .2695556
                                                                                                   index_afl_4 |  -.0339196   .1366815    -0.25   0.804    -.3018105    .2339712
                                                                                                           njc |   .0036501   .0113096     0.32   0.747    -.0185163    .0258164
                                                                                                           sjc |  -.0184142   .0174289    -1.06   0.291    -.0525743    .0157459
                                                                                                         pcuse |  -.0621935   .0516762    -1.20   0.229     -.163477    .0390901
                                                                                                         _cons |  -1.347829   .6035713    -2.23   0.026    -2.530807   -.1648508
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
r; t=1.94 14:56:26

. est store reg2012
r; t=0.00 14:56:26

. 
. mat b12 = e(b)
r; t=0.00 14:56:26

. predict lhw2012 if e(sample), xb 
(12639 missing values generated)
r; t=0.02 14:56:26

. do $git\4_mypredictor

. cap program drop mypredictor
r; t=0.00 14:56:26

. program mypredictor
  1. *specify year with command
. *you need beta for this year of the model mypredictor
.    local i = `1'
  2. *local name = `2'
. **********************************
. matrix gamma`i' =  b`i'[1,40..52]
  3. cap drop xb`i'
  4. * calculate predicted value 
. gen xb`i' = b`i'[1,1]* lowskill + b`i'[1,3]  * highskill        + b`i'[1,4]  * zpalter  + b`i'[1,5] * zpalter_sq  ///
> + b`i'[1,6] * lowskill * zpalter + b`i'[1,8]  * highskill * zpalter + b`i'[1,9]  * lowskill * zpalter_sq      ///
> + b`i'[1,11] * highskill * zpalter_sq    + b`i'[1,12] * occ1  + 0       + b`i'[1,13] * occ2     ///
> + b`i'[1,14] * occ3  + b`i'[1,15] * occ4 + b`i'[1,16] * occ5   + b`i'[1,17] * occ6         +    ///
> b`i'[1,18] * occ7   + b`i'[1,19] * occ8   + b`i'[1,20] * occ9   + b`i'[1,21] * occ10 +          ///
> b`i'[1,22] * occ11 + b`i'[1,23] * occ12   + b`i'[1,25] * occ14  + b`i'[1,26] * occ15            /// 
> + b`i'[1,27] * occ16 + b`i'[1,28] * occ17 + b`i'[1,29] * occ18     + b`i'[1,30] * occ19         ///
> + b`i'[1,31] * occ20 ///
>  + b`i'[1,32] * index_afl_1  + b`i'[1,33] * index_afl_2  + b`i'[1,34] *index_afl_3 + b`i'[1,35] * index_afl_4 ///
>  + b`i'[1,36] * njc  + b`i'[1,37] * sjc  + b`i'[1,38] * pcuse + b`i'[1,39] if e(sample)
  5. ****************************************************************************************************
. * calculate sigma: 
. cap drop sigma`i'
  6. gen sigma`i' = exp( gamma`i'[1,1] * zpalter + gamma`i'[1,2] * zpalter_sq + gamma`i'[1,3] *lowskill ///
> + gamma`i'[1,5] * highskill + gamma`i'[1,6] * index_afl_1 + gamma`i'[1,7] * index_afl_2          ///
> + gamma`i'[1,8] * index_afl_3 + gamma`i'[1,9] * index_afl_4 + gamma`i'[1,10] * njc                              ///
> + gamma`i'[1,11] * sjc + gamma`i'[1,12] * pcuse + gamma`i'[1,13] ) if e(sample)
  7. end
r; t=0.00 14:56:26

. 
. 
end of do-file
r; t=0.02 14:56:26

. mypredictor 12  //gives xb12 and sigma12
(12639 missing values generated)
(12639 missing values generated)
r; t=0.02 14:56:26

. ******************************************************************************************
. *** 1999
. intreg lhw_lower lhw_upper (b2.skilllevel)##(c.zpalter##c.zpalter) ///
>         b13.occupational_categories index_afl_1 - index_afl_4 njc sjc pcuse [pw=gew] ///
>         if cond==1 & bibb1999==1, ///
>         het(c.zpalter##c.zpalter b2.skilllevel index_afl_1 - index_afl_4 njc sjc pcuse)   

Fitting full model:

Iteration 0:   log pseudolikelihood = -31123.092  
Iteration 1:   log pseudolikelihood =  -24524.52  
Iteration 2:   log pseudolikelihood = -24322.093  
Iteration 3:   log pseudolikelihood = -24311.348  
Iteration 4:   log pseudolikelihood = -24311.326  
Iteration 5:   log pseudolikelihood = -24311.326  

Interval regression                               Number of obs   =       6853
                                                  Wald chi2(34)   =    1797.23
Log pseudolikelihood = -24311.326                 Prob > chi2     =     0.0000

--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
                                                                                                               |               Robust
                                                                                                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------------------------------------------------------------------------------------------------+----------------------------------------------------------------
model                                                                                                          |
                                                                                                    skilllevel |
                                                                                                       1. low  |  -.0874084    .351207    -0.25   0.803    -.7757615    .6009447
                                                                                                      3. high  |  -1.436048   .4027106    -3.57   0.000    -2.225346   -.6467495
                                                                                                               |
                                                                                                       zpalter |   .0314144   .0057827     5.43   0.000     .0200806    .0427483
                                                                                                               |
                                                                                           c.zpalter#c.zpalter |  -.0003029   .0000724    -4.19   0.000    -.0004448   -.0001611
                                                                                                               |
                                                                                          skilllevel#c.zpalter |
                                                                                                       1. low  |  -.0016372   .0183078    -0.09   0.929    -.0375199    .0342455
                                                                                                      3. high  |   .0678067    .020268     3.35   0.001     .0280821    .1075313
                                                                                                               |
                                                                                skilllevel#c.zpalter#c.zpalter |
                                                                                                       1. low  |    .000077   .0002302     0.33   0.738    -.0003743    .0005283
                                                                                                      3. high  |  -.0007156   .0002486    -2.88   0.004    -.0012028   -.0002283
                                                                                                               |
                                                                                       occupational_categories |
                                                                                     1. Agriculture, Forestry  |  -.2682709   .0603781    -4.44   0.000    -.3866098   -.1499319
                                                     2. Mining, Mineral winning, Stonery, Material production  |   .0097279   .0621812     0.16   0.876    -.1121449    .1316008
                                                                                         3. Chemical industry  |   .1438928   .0392171     3.67   0.000     .0670286     .220757
                                          4. Paper manufacturing, paper converting, printing, wood processing  |   .1242706   .0367737     3.38   0.001     .0521956    .1963457
                                                                                     5. Metalworking industry  |   .1040353   .0296684     3.51   0.000     .0458863    .1621843
                                                                            6. Metal-structuring, engineering  |   .0511985   .0229874     2.23   0.026     .0061441     .096253
                                                                                   7.  Electrical engineering  |   .0174866    .027464     0.64   0.524    -.0363419    .0713151
                                                       8. Apparel industry, leather production and processing  |  -.1406284   .0835459    -1.68   0.092    -.3043753    .0231184
                                                                                             9. food industry  |  -.1046044   .0321881    -3.25   0.001    -.1676919   -.0415169
                                                                         10. Structural and civil engineering  |  -.0273838    .027668    -0.99   0.322    -.0816121    .0268444
                                                                                     11. Lining, upholstering  |  -.0264563   .0331597    -0.80   0.425    -.0914481    .0385356
                                                                             12. Wood- and plastic processing  |  -.0842952   .0433144    -1.95   0.052    -.1691899    .0005996
                                                                      14. Chemists, Physicist, Mathematicians  |   .1643176   .0303577     5.41   0.000     .1048176    .2238177
                                                                                      15. Technical engineers  |   .0971267   .0246229     3.94   0.000     .0488668    .1453866
                                                                                                16. Merchants  |  -.0821079   .0301818    -2.72   0.007    -.1412631   -.0229526
                                                                                        17. Service merchants  |   .1040512   .0300456     3.46   0.001     .0451629    .1629395
                                                                                         18. Transport sector  |  -.0714071   .0274704    -2.60   0.009     -.125248   -.0175662
                                                                             19. Organisation, Administration  |   .0789254   .0251728     3.14   0.002     .0295876    .1282633
20. Occupation of order and security, Artist, Health Service, Social and educational occ., other service occ.  |   .0060188   .0245477     0.25   0.806    -.0420937    .0541313
                                                                                                               |
                                                                                                   index_afl_1 |   .2251988    .030375     7.41   0.000     .1656649    .2847326
                                                                                                   index_afl_2 |   .1642659   .0214229     7.67   0.000     .1222778     .206254
                                                                                                   index_afl_3 |   .0900679   .0259962     3.46   0.001     .0391162    .1410195
                                                                                                   index_afl_4 |   .0928299   .0221239     4.20   0.000     .0494679    .1361919
                                                                                                           njc |   .0093196   .0025171     3.70   0.000     .0043861     .014253
                                                                                                           sjc |   .0199288   .0034597     5.76   0.000     .0131479    .0267097
                                                                                                         pcuse |    .129409   .0110691    11.69   0.000      .107714     .151104
                                                                                                         _cons |   1.484775   .1138326    13.04   0.000     1.261667    1.707882
---------------------------------------------------------------------------------------------------------------+----------------------------------------------------------------
lnsigma                                                                                                        |
                                                                                                       zpalter |   .0128614   .0157984     0.81   0.416    -.0181029    .0438257
                                                                                                               |
                                                                                           c.zpalter#c.zpalter |  -.0001236   .0001991    -0.62   0.535    -.0005138    .0002667
                                                                                                               |
                                                                                                    skilllevel |
                                                                                                       1. low  |   .0203227   .0473027     0.43   0.667    -.0723889    .1130344
                                                                                                      3. high  |   .1021674   .0559807     1.83   0.068    -.0075527    .2118876
                                                                                                               |
                                                                                                   index_afl_1 |   .0531883   .0968551     0.55   0.583    -.1366442    .2430209
                                                                                                   index_afl_2 |   .0326051   .0617608     0.53   0.598    -.0884439    .1536541
                                                                                                   index_afl_3 |   -.113175   .0766545    -1.48   0.140     -.263415     .037065
                                                                                                   index_afl_4 |    .001849   .0643101     0.03   0.977    -.1241964    .1278945
                                                                                                           njc |   .0008869    .007284     0.12   0.903    -.0133896    .0151634
                                                                                                           sjc |   .0171545   .0109342     1.57   0.117     -.004276    .0385851
                                                                                                         pcuse |  -.0810967    .029689    -2.73   0.006     -.139286   -.0229074
                                                                                                         _cons |   -1.39742   .3032006    -4.61   0.000    -1.991682   -.8031579
--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

  Observation summary:        10  left-censored observations
                               0     uncensored observations
                               0 right-censored observations
                            6843       interval observations
r; t=6.17 14:56:32

. est store reg1999
r; t=0.02 14:56:32

. mat b99 = e(b)
r; t=0.00 14:56:32

. mypredictor 99 //gives xb99 and sigma99
(9238 missing values generated)
(9238 missing values generated)
r; t=0.02 14:56:32

. ******************************************************************************************
. sum xb?? sigma??

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
        xb06 |      4178     2.86254    .2381814   1.904212   3.426034
        xb12 |      3452    2.959598     .260912   2.151215   3.696904
        xb99 |      6853    2.500313    .2023208   1.844399   3.041086
     sigma06 |      4178    .4610704    .0419027   .3692661   .6768895
     sigma12 |      3452    .5054623    .0347007   .3948888   .6319531
-------------+--------------------------------------------------------
     sigma99 |      6853    .3310718    .0221312   .2561842   .4186845
r; t=0.02 14:56:32

. est tab reg1999 reg2006 reg2012, star b(%7.3f) stats(N) equations(1) 

-----------------------------------------------------
    Variable |  reg1999      reg2006      reg2012    
-------------+---------------------------------------
#1           |
  skilllevel |
     1. low  |  -0.087       -2.657       -1.744     
             |
  skilllevel |
    3. high  |  -1.436***    -1.649***    -0.417     
             |
     zpalter |   0.031***     0.046***     0.061***  
             |
   c.zpalter#|
   c.zpalter |  -0.000***    -0.000**     -0.001***  
             |
  skilllevel#|
   c.zpalter |
     1. low  |  -0.002        0.151        0.072     
             |
  skilllevel#|
   c.zpalter |
    3. high  |   0.068***     0.080***     0.024     
             |
  skilllevel#|
   c.zpalter#|
   c.zpalter |
     1. low  |   0.000       -0.002*      -0.001     
             |
  skilllevel#|
   c.zpalter#|
   c.zpalter |
    3. high  |  -0.001**     -0.001**     -0.000     
             |
occupation~s |
1. Agricu..  |  -0.268***     0.025       -0.086     
2. Mining..  |   0.010        0.179       -0.056     
3. Chemic..  |   0.144***     0.245*       0.125     
4. Paper ..  |   0.124***     0.214*       0.187     
5. Metalw..  |   0.104***     0.167*       0.109     
6. Metal-..  |   0.051*       0.160**      0.143     
7.  Elect..  |   0.017        0.111        0.090     
8. Appare..  |  -0.141       -0.097       -0.082     
9. food i..  |  -0.105**     -0.050       -0.117     
10. Struc..  |  -0.027        0.060        0.096     
11. Linin..  |  -0.026        0.158        0.109     
12. Wood-..  |  -0.084        0.079       -0.120     
             |
occupation~s |
14. Chemi..  |   0.164***     0.318***     0.329***  
15. Techn..  |   0.097***     0.231***     0.160*    
16. Merch..  |  -0.082**      0.153*       0.106     
17. Servi..  |   0.104***     0.341***     0.170     
18. Trans..  |  -0.071**     -0.032       -0.157     
19. Organ..  |   0.079**      0.267***     0.190*    
20. Occup..  |   0.006        0.066        0.011     
             |
 index_afl_1 |   0.225***     0.224**      0.245**   
 index_afl_2 |   0.164***     0.223***     0.165*    
 index_afl_3 |   0.090***     0.011        0.005     
 index_afl_4 |   0.093***     0.148*       0.145*    
         njc |   0.009***     0.008        0.008     
         sjc |   0.020***     0.019**      0.027**   
       pcuse |   0.129***     0.142***     0.146***  
       _cons |   1.485***     1.247***     1.032***  
-------------+---------------------------------------
lnsigma      |
     zpalter |   0.013       -0.016        0.029     
             |
   c.zpalter#|
   c.zpalter |  -0.000        0.000       -0.000     
             |
  skilllevel |
     1. low  |   0.020       -0.013       -0.037     
             |
  skilllevel |
    3. high  |   0.102       -0.010        0.061     
             |
 index_afl_1 |   0.053       -0.253        0.114     
 index_afl_2 |   0.033       -0.163       -0.001     
 index_afl_3 |  -0.113       -0.284       -0.050     
 index_afl_4 |   0.002       -0.232       -0.034     
         njc |   0.001        0.007        0.004     
         sjc |   0.017       -0.050**     -0.018     
       pcuse |  -0.081**     -0.041       -0.062     
       _cons |  -1.397***    -0.168       -1.348*    
-------------+---------------------------------------
Statistics   |                                       
           N |    6853         4178         3452     
-----------------------------------------------------
             legend: * p<0.05; ** p<0.01; *** p<0.001
r; t=0.16 14:56:32

. mat list r(coef) , format(%7.3f) 

r(coef)[52,6]
               reg1999:  reg1999:  reg2006:  reg2006:  reg2012:  reg2012:
                     b       var         b       var         b       var
          #1:
1.skilllevel    -0.087     0.123    -2.657     2.268    -1.744     1.863
2.skilllevel        .b        .b        .b        .b        .b        .b
3.skilllevel    -1.436     0.162    -1.649     0.232    -0.417     0.354
     zpalter     0.031     0.000     0.046     0.000     0.061     0.000
   c.zpalter#
   c.zpalter    -0.000     0.000    -0.000     0.000    -0.001     0.000
1.skilllevel#
   c.zpalter    -0.002     0.000     0.151     0.006     0.072     0.005
2.skilllevel#
   c.zpalter        .b        .b        .b        .b        .b        .b
3.skilllevel#
   c.zpalter     0.068     0.000     0.080     0.001     0.024     0.001
1.skilllevel#
   c.zpalter#
   c.zpalter     0.000     0.000    -0.002     0.000    -0.001     0.000
2.skilllevel#
   c.zpalter#
   c.zpalter        .b        .b        .b        .b        .b        .b
3.skilllevel#
   c.zpalter#
   c.zpalter    -0.001     0.000    -0.001     0.000    -0.000     0.000
1.occupati~s    -0.268     0.004     0.025     0.008    -0.086     0.011
2.occupati~s     0.010     0.004     0.179     0.011    -0.056     0.041
3.occupati~s     0.144     0.002     0.245     0.010     0.125     0.009
4.occupati~s     0.124     0.001     0.214     0.009     0.187     0.024
5.occupati~s     0.104     0.001     0.167     0.005     0.109     0.008
6.occupati~s     0.051     0.001     0.160     0.003     0.143     0.006
7.occupati~s     0.017     0.001     0.111     0.004     0.090     0.007
8.occupati~s    -0.141     0.007    -0.097     0.029    -0.082     0.013
9.occupati~s    -0.105     0.001    -0.050     0.004    -0.117     0.008
10.occupat~s    -0.027     0.001     0.060     0.007     0.096     0.011
11.occupat~s    -0.026     0.001     0.158     0.009     0.109     0.011
12.occupat~s    -0.084     0.002     0.079     0.010    -0.120     0.008
13.occupat~s        .b        .b        .b        .b        .b        .b
14.occupat~s     0.164     0.001     0.318     0.004     0.329     0.008
15.occupat~s     0.097     0.001     0.231     0.003     0.160     0.006
16.occupat~s    -0.082     0.001     0.153     0.005     0.106     0.008
17.occupat~s     0.104     0.001     0.341     0.004     0.170     0.008
18.occupat~s    -0.071     0.001    -0.032     0.004    -0.157     0.007
19.occupat~s     0.079     0.001     0.267     0.003     0.190     0.006
20.occupat~s     0.006     0.001     0.066     0.004     0.011     0.006
 index_afl_1     0.225     0.001     0.224     0.005     0.245     0.006
 index_afl_2     0.164     0.000     0.223     0.004     0.165     0.004
 index_afl_3     0.090     0.001     0.011     0.006     0.005     0.006
 index_afl_4     0.093     0.000     0.148     0.004     0.145     0.005
         njc     0.009     0.000     0.008     0.000     0.008     0.000
         sjc     0.020     0.000     0.019     0.000     0.027     0.000
       pcuse     0.129     0.000     0.142     0.001     0.146     0.001
       _cons     1.485     0.013     1.247     0.059     1.032     0.074
     lnsigma:
     zpalter     0.013     0.000    -0.016     0.000     0.029     0.001
   c.zpalter#
   c.zpalter    -0.000     0.000     0.000     0.000    -0.000     0.000
1.skilllevel     0.020     0.002    -0.013     0.019    -0.037     0.014
2.skilllevel        .b        .b        .b        .b        .b        .b
3.skilllevel     0.102     0.003    -0.010     0.003     0.061     0.007
 index_afl_1     0.053     0.009    -0.253     0.036     0.114     0.024
 index_afl_2     0.033     0.004    -0.163     0.028    -0.001     0.017
 index_afl_3    -0.113     0.006    -0.284     0.040    -0.050     0.027
 index_afl_4     0.002     0.004    -0.232     0.041    -0.034     0.019
         njc     0.001     0.000     0.007     0.000     0.004     0.000
         sjc     0.017     0.000    -0.050     0.000    -0.018     0.000
       pcuse    -0.081     0.001    -0.041     0.002    -0.062     0.003
       _cons    -1.397     0.092    -0.168     0.191    -1.348     0.364
r; t=0.00 14:56:32

. lab var pcuse "pcuse"
r; t=0.00 14:56:32

. lab var index_afl_1 "afl 1"
r; t=0.00 14:56:32

. lab var index_afl_2 "afl 2"
r; t=0.00 14:56:32

. lab var index_afl_3 "afl 3"
r; t=0.00 14:56:32

. lab var index_afl_4 "afl 4"
r; t=0.00 14:56:32

. lab var index_afl_5 "afl 5"
r; t=0.00 14:56:32

. estout reg1999 reg2006 reg2012 using $git\tables\regressions.tex, ///
>                                 label cells(b(star fmt(3)) ) ///
>                                 equations(1) wrap style(tex) stats(N, fmt(0)) ///
>                                 rename(_cons constant) ///
>                                 title(Regression results) legend replace
(output written to E:\tables\regressions.tex)
r; t=0.30 14:56:32

. esttab reg1999 reg2006 reg2012 using $git\tables\regressions2.tex, ar2 label se star replace
(output written to E:\tables\regressions2.tex)
r; t=0.45 14:56:33

. * t(par fmt(2))
. *outreg2 [reg1999 reg2006 reg2012] using $git\tables\regressions.tex, replace seeout tex(pretty)
. * 1999 regression has more stat. power since nearly twice as much obs. remain in reg.
. * c.p. to 2006 /2012
. ******************************************************************************************
. ******************************************************************************************
. ******************************************************************************************
. ** set range:
. global min = -1
r; t=0.00 14:56:33

. global max = 20 
r; t=0.00 14:56:33

. *calculate unconditional distribution.
. set matsize 10000
r; t=0.00 14:56:33

. *mat y = (- 1 , 0, 0)
. *forvalues i = -0.99(0.01)10 {
. *       mat y = (y \ `i' , 0 , 0)  
. *}
. cap drop y
r; t=0.00 14:56:33

. egen y = fill( $min(0.01)10)
r; t=0.17 14:56:33

. replace y = . if y > $max
(13991 real changes made, 13991 to missing)
r; t=0.00 14:56:33

. replace y = round(y, .001)
(1548 real changes made)
r; t=0.00 14:56:33

. mkmat y if y!=.  
r; t=0.11 14:56:33

. sum y // get number of non-missing-obs 

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
           y |      2100       9.495    6.063621         -1      19.99
r; t=0.00 14:56:33

. global n = r(N)
r; t=0.00 14:56:33

. *levelsof y, local(levels)  // alternative to get number of obs in y 
. *global n: word count `levels'
. cap drop phi_hat_*
r; t=0.00 14:56:33

. mat y = (y, J($n,3,0))
r; t=0.05 14:56:33

. mat list y

y[2100,4]
                y          c1          c2          c3
   r1          -1           0           0           0
   r2  -.99000001           0           0           0
   r3  -.98000002           0           0           0
   r4  -.97000003           0           0           0
   r5  -.95999998           0           0           0
   r6  -.94999999           0           0           0
   r7        -.94           0           0           0
   r8  -.93000001           0           0           0
   r9  -.92000002           0           0           0
  r10  -.91000003           0           0           0
  r11  -.89999998           0           0           0
  r12  -.88999999           0           0           0
  r13        -.88           0           0           0
  r14        -.87           0           0           0
  r15  -.86000001           0           0           0
  r16  -.85000002           0           0           0
  r17  -.83999997           0           0           0
  r18  -.82999998           0           0           0
  r19  -.81999999           0           0           0
  r20        -.81           0           0           0
  r21  -.80000001           0           0           0
  r22  -.79000002           0           0           0
  r23  -.77999997           0           0           0
  r24  -.76999998           0           0           0
  r25  -.75999999           0           0           0
  r26        -.75           0           0           0
  r27  -.74000001           0           0           0
  r28  -.73000002           0           0           0
  r29  -.72000003           0           0           0
  r30  -.70999998           0           0           0
  r31  -.69999999           0           0           0
  r32        -.69           0           0           0
  r33  -.68000001           0           0           0
  r34  -.67000002           0           0           0
  r35  -.66000003           0           0           0
  r36  -.64999998           0           0           0
  r37  -.63999999           0           0           0
  r38        -.63           0           0           0
  r39        -.62           0           0           0
  r40  -.61000001           0           0           0
  r41  -.60000002           0           0           0
  r42  -.58999997           0           0           0
  r43  -.57999998           0           0           0
  r44  -.56999999           0           0           0
  r45        -.56           0           0           0
  r46  -.55000001           0           0           0
  r47  -.54000002           0           0           0
  r48  -.52999997           0           0           0
  r49  -.51999998           0           0           0
  r50  -.50999999           0           0           0
  r51         -.5           0           0           0
  r52  -.49000001           0           0           0
  r53  -.47999999           0           0           0
  r54        -.47           0           0           0
  r55  -.46000001           0           0           0
  r56  -.44999999           0           0           0
  r57        -.44           0           0           0
  r58  -.43000001           0           0           0
  r59  -.41999999           0           0           0
  r60        -.41           0           0           0
  r61  -.40000001           0           0           0
  r62  -.38999999           0           0           0
  r63        -.38           0           0           0
  r64        -.37           0           0           0
  r65  -.36000001           0           0           0
  r66  -.34999999           0           0           0
  r67        -.34           0           0           0
  r68  -.33000001           0           0           0
  r69  -.31999999           0           0           0
  r70        -.31           0           0           0
  r71  -.30000001           0           0           0
  r72  -.28999999           0           0           0
  r73        -.28           0           0           0
  r74  -.27000001           0           0           0
  r75  -.25999999           0           0           0
  r76        -.25           0           0           0
  r77  -.23999999           0           0           0
  r78        -.23           0           0           0
  r79        -.22           0           0           0
  r80  -.20999999           0           0           0
  r81         -.2           0           0           0
  r82        -.19           0           0           0
  r83  -.18000001           0           0           0
  r84        -.17           0           0           0
  r85        -.16           0           0           0
  r86  -.15000001           0           0           0
  r87        -.14           0           0           0
  r88        -.13           0           0           0
  r89        -.12           0           0           0
  r90        -.11           0           0           0
  r91         -.1           0           0           0
  r92        -.09           0           0           0
  r93        -.08           0           0           0
  r94        -.07           0           0           0
  r95        -.06           0           0           0
  r96        -.05           0           0           0
  r97        -.04           0           0           0
  r98        -.03           0           0           0
  r99        -.02           0           0           0
 r100        -.01           0           0           0
 r101           0           0           0           0
 r102         .01           0           0           0
 r103         .02           0           0           0
 r104         .03           0           0           0
 r105         .04           0           0           0
 r106         .05           0           0           0
 r107         .06           0           0           0
 r108         .07           0           0           0
 r109         .08           0           0           0
 r110         .09           0           0           0
 r111          .1           0           0           0
 r112         .11           0           0           0
 r113         .12           0           0           0
 r114         .13           0           0           0
 r115         .14           0           0           0
 r116   .15000001           0           0           0
 r117         .16           0           0           0
 r118         .17           0           0           0
 r119   .18000001           0           0           0
 r120         .19           0           0           0
 r121          .2           0           0           0
 r122   .20999999           0           0           0
 r123         .22           0           0           0
 r124         .23           0           0           0
 r125   .23999999           0           0           0
 r126         .25           0           0           0
 r127   .25999999           0           0           0
 r128   .27000001           0           0           0
 r129         .28           0           0           0
 r130   .28999999           0           0           0
 r131   .30000001           0           0           0
 r132         .31           0           0           0
 r133   .31999999           0           0           0
 r134   .33000001           0           0           0
 r135         .34           0           0           0
 r136   .34999999           0           0           0
 r137   .36000001           0           0           0
 r138         .37           0           0           0
 r139         .38           0           0           0
 r140   .38999999           0           0           0
 r141   .40000001           0           0           0
 r142         .41           0           0           0
 r143   .41999999           0           0           0
 r144   .43000001           0           0           0
 r145         .44           0           0           0
 r146   .44999999           0           0           0
 r147   .46000001           0           0           0
 r148         .47           0           0           0
 r149   .47999999           0           0           0
 r150   .49000001           0           0           0
 r151          .5           0           0           0
 r152   .50999999           0           0           0
 r153   .51999998           0           0           0
 r154   .52999997           0           0           0
 r155   .54000002           0           0           0
 r156   .55000001           0           0           0
 r157         .56           0           0           0
 r158   .56999999           0           0           0
 r159   .57999998           0           0           0
 r160   .58999997           0           0           0
 r161   .60000002           0           0           0
 r162   .61000001           0           0           0
 r163         .62           0           0           0
 r164         .63           0           0           0
 r165   .63999999           0           0           0
 r166   .64999998           0           0           0
 r167   .66000003           0           0           0
 r168   .67000002           0           0           0
 r169   .68000001           0           0           0
 r170         .69           0           0           0
 r171   .69999999           0           0           0
 r172   .70999998           0           0           0
 r173   .72000003           0           0           0
 r174   .73000002           0           0           0
 r175   .74000001           0           0           0
 r176         .75           0           0           0
 r177   .75999999           0           0           0
 r178   .76999998           0           0           0
 r179   .77999997           0           0           0
 r180   .79000002           0           0           0
 r181   .80000001           0           0           0
 r182         .81           0           0           0
 r183   .81999999           0           0           0
 r184   .82999998           0           0           0
 r185   .83999997           0           0           0
 r186   .85000002           0           0           0
 r187   .86000001           0           0           0
 r188         .87           0           0           0
 r189         .88           0           0           0
 r190   .88999999           0           0           0
 r191   .89999998           0           0           0
 r192   .91000003           0           0           0
 r193   .92000002           0           0           0
 r194   .93000001           0           0           0
 r195         .94           0           0           0
 r196   .94999999           0           0           0
 r197   .95999998           0           0           0
 r198   .97000003           0           0           0
 r199   .98000002           0           0           0
 r200   .99000001           0           0           0
 r201           1           0           0           0
 r202        1.01           0           0           0
 r203        1.02           0           0           0
 r204        1.03           0           0           0
 r205        1.04           0           0           0
 r206        1.05           0           0           0
 r207   1.0599999           0           0           0
 r208   1.0700001           0           0           0
 r209        1.08           0           0           0
 r210        1.09           0           0           0
 r211         1.1           0           0           0
 r212        1.11           0           0           0
 r213        1.12           0           0           0
 r214        1.13           0           0           0
 r215        1.14           0           0           0
 r216        1.15           0           0           0
 r217        1.16           0           0           0
 r218        1.17           0           0           0
 r219   1.1799999           0           0           0
 r220   1.1900001           0           0           0
 r221         1.2           0           0           0
 r222        1.21           0           0           0
 r223        1.22           0           0           0
 r224        1.23           0           0           0
 r225        1.24           0           0           0
 r226        1.25           0           0           0
 r227        1.26           0           0           0
 r228        1.27           0           0           0
 r229        1.28           0           0           0
 r230        1.29           0           0           0
 r231         1.3           0           0           0
 r232   1.3099999           0           0           0
 r233   1.3200001           0           0           0
 r234        1.33           0           0           0
 r235        1.34           0           0           0
 r236        1.35           0           0           0
 r237        1.36           0           0           0
 r238        1.37           0           0           0
 r239        1.38           0           0           0
 r240        1.39           0           0           0
 r241         1.4           0           0           0
 r242        1.41           0           0           0
 r243        1.42           0           0           0
 r244   1.4299999           0           0           0
 r245   1.4400001           0           0           0
 r246        1.45           0           0           0
 r247        1.46           0           0           0
 r248        1.47           0           0           0
 r249        1.48           0           0           0
 r250        1.49           0           0           0
 r251         1.5           0           0           0
 r252        1.51           0           0           0
 r253        1.52           0           0           0
 r254        1.53           0           0           0
 r255        1.54           0           0           0
 r256        1.55           0           0           0
 r257   1.5599999           0           0           0
 r258   1.5700001           0           0           0
 r259        1.58           0           0           0
 r260        1.59           0           0           0
 r261         1.6           0           0           0
 r262        1.61           0           0           0
 r263        1.62           0           0           0
 r264        1.63           0           0           0
 r265        1.64           0           0           0
 r266        1.65           0           0           0
 r267        1.66           0           0           0
 r268        1.67           0           0           0
 r269   1.6799999           0           0           0
 r270   1.6900001           0           0           0
 r271         1.7           0           0           0
 r272        1.71           0           0           0
 r273        1.72           0           0           0
 r274        1.73           0           0           0
 r275        1.74           0           0           0
 r276        1.75           0           0           0
 r277        1.76           0           0           0
 r278        1.77           0           0           0
 r279        1.78           0           0           0
 r280        1.79           0           0           0
 r281         1.8           0           0           0
 r282   1.8099999           0           0           0
 r283   1.8200001           0           0           0
 r284        1.83           0           0           0
 r285        1.84           0           0           0
 r286        1.85           0           0           0
 r287        1.86           0           0           0
 r288        1.87           0           0           0
 r289        1.88           0           0           0
 r290        1.89           0           0           0
 r291         1.9           0           0           0
 r292        1.91           0           0           0
 r293        1.92           0           0           0
 r294   1.9299999           0           0           0
 r295   1.9400001           0           0           0
 r296        1.95           0           0           0
 r297        1.96           0           0           0
 r298        1.97           0           0           0
 r299        1.98           0           0           0
 r300        1.99           0           0           0
 r301           2           0           0           0
 r302        2.01           0           0           0
 r303        2.02           0           0           0
 r304        2.03           0           0           0
 r305        2.04           0           0           0
 r306        2.05           0           0           0
 r307   2.0599999           0           0           0
 r308   2.0699999           0           0           0
 r309   2.0799999           0           0           0
 r310   2.0899999           0           0           0
 r311   2.0999999           0           0           0
 r312   2.1099999           0           0           0
 r313   2.1199999           0           0           0
 r314   2.1300001           0           0           0
 r315   2.1400001           0           0           0
 r316   2.1500001           0           0           0
 r317   2.1600001           0           0           0
 r318   2.1700001           0           0           0
 r319   2.1800001           0           0           0
 r320   2.1900001           0           0           0
 r321         2.2           0           0           0
 r322        2.21           0           0           0
 r323        2.22           0           0           0
 r324        2.23           0           0           0
 r325        2.24           0           0           0
 r326        2.25           0           0           0
 r327        2.26           0           0           0
 r328        2.27           0           0           0
 r329        2.28           0           0           0
 r330        2.29           0           0           0
 r331         2.3           0           0           0
 r332   2.3099999           0           0           0
 r333   2.3199999           0           0           0
 r334   2.3299999           0           0           0
 r335   2.3399999           0           0           0
 r336   2.3499999           0           0           0
 r337   2.3599999           0           0           0
 r338   2.3699999           0           0           0
 r339   2.3800001           0           0           0
 r340   2.3900001           0           0           0
 r341   2.4000001           0           0           0
 r342   2.4100001           0           0           0
 r343   2.4200001           0           0           0
 r344   2.4300001           0           0           0
 r345   2.4400001           0           0           0
 r346        2.45           0           0           0
 r347        2.46           0           0           0
 r348        2.47           0           0           0
 r349        2.48           0           0           0
 r350        2.49           0           0           0
 r351         2.5           0           0           0
 r352        2.51           0           0           0
 r353        2.52           0           0           0
 r354        2.53           0           0           0
 r355        2.54           0           0           0
 r356        2.55           0           0           0
 r357   2.5599999           0           0           0
 r358   2.5699999           0           0           0
 r359   2.5799999           0           0           0
 r360   2.5899999           0           0           0
 r361   2.5999999           0           0           0
 r362   2.6099999           0           0           0
 r363   2.6199999           0           0           0
 r364   2.6300001           0           0           0
 r365   2.6400001           0           0           0
 r366   2.6500001           0           0           0
 r367   2.6600001           0           0           0
 r368   2.6700001           0           0           0
 r369   2.6800001           0           0           0
 r370   2.6900001           0           0           0
 r371         2.7           0           0           0
 r372        2.71           0           0           0
 r373        2.72           0           0           0
 r374        2.73           0           0           0
 r375        2.74           0           0           0
 r376        2.75           0           0           0
 r377        2.76           0           0           0
 r378        2.77           0           0           0
 r379        2.78           0           0           0
 r380        2.79           0           0           0
 r381         2.8           0           0           0
 r382   2.8099999           0           0           0
 r383   2.8199999           0           0           0
 r384   2.8299999           0           0           0
 r385   2.8399999           0           0           0
 r386   2.8499999           0           0           0
 r387   2.8599999           0           0           0
 r388   2.8699999           0           0           0
 r389   2.8800001           0           0           0
 r390   2.8900001           0           0           0
 r391   2.9000001           0           0           0
 r392   2.9100001           0           0           0
 r393   2.9200001           0           0           0
 r394   2.9300001           0           0           0
 r395   2.9400001           0           0           0
 r396        2.95           0           0           0
 r397        2.96           0           0           0
 r398        2.97           0           0           0
 r399        2.98           0           0           0
 r400        2.99           0           0           0
 r401           3           0           0           0
 r402        3.01           0           0           0
 r403        3.02           0           0           0
 r404        3.03           0           0           0
 r405        3.04           0           0           0
 r406        3.05           0           0           0
 r407   3.0599999           0           0           0
 r408   3.0699999           0           0           0
 r409   3.0799999           0           0           0
 r410   3.0899999           0           0           0
 r411   3.0999999           0           0           0
 r412   3.1099999           0           0           0
 r413   3.1199999           0           0           0
 r414   3.1300001           0           0           0
 r415   3.1400001           0           0           0
 r416   3.1500001           0           0           0
 r417   3.1600001           0           0           0
 r418   3.1700001           0           0           0
 r419   3.1800001           0           0           0
 r420   3.1900001           0           0           0
 r421         3.2           0           0           0
 r422        3.21           0           0           0
 r423        3.22           0           0           0
 r424        3.23           0           0           0
 r425        3.24           0           0           0
 r426        3.25           0           0           0
 r427        3.26           0           0           0
 r428        3.27           0           0           0
 r429        3.28           0           0           0
 r430        3.29           0           0           0
 r431         3.3           0           0           0
 r432   3.3099999           0           0           0
 r433   3.3199999           0           0           0
 r434   3.3299999           0           0           0
 r435   3.3399999           0           0           0
 r436   3.3499999           0           0           0
 r437   3.3599999           0           0           0
 r438   3.3699999           0           0           0
 r439   3.3800001           0           0           0
 r440   3.3900001           0           0           0
 r441   3.4000001           0           0           0
 r442   3.4100001           0           0           0
 r443   3.4200001           0           0           0
 r444   3.4300001           0           0           0
 r445   3.4400001           0           0           0
 r446        3.45           0           0           0
 r447        3.46           0           0           0
 r448        3.47           0           0           0
 r449        3.48           0           0           0
 r450        3.49           0           0           0
 r451         3.5           0           0           0
 r452        3.51           0           0           0
 r453        3.52           0           0           0
 r454        3.53           0           0           0
 r455        3.54           0           0           0
 r456        3.55           0           0           0
 r457   3.5599999           0           0           0
 r458   3.5699999           0           0           0
 r459   3.5799999           0           0           0
 r460   3.5899999           0           0           0
 r461   3.5999999           0           0           0
 r462   3.6099999           0           0           0
 r463   3.6199999           0           0           0
 r464   3.6300001           0           0           0
 r465   3.6400001           0           0           0
 r466   3.6500001           0           0           0
 r467   3.6600001           0           0           0
 r468   3.6700001           0           0           0
 r469   3.6800001           0           0           0
 r470   3.6900001           0           0           0
 r471         3.7           0           0           0
 r472        3.71           0           0           0
 r473        3.72           0           0           0
 r474        3.73           0           0           0
 r475        3.74           0           0           0
 r476        3.75           0           0           0
 r477        3.76           0           0           0
 r478        3.77           0           0           0
 r479        3.78           0           0           0
 r480        3.79           0           0           0
 r481         3.8           0           0           0
 r482   3.8099999           0           0           0
 r483   3.8199999           0           0           0
 r484   3.8299999           0           0           0
 r485   3.8399999           0           0           0
 r486   3.8499999           0           0           0
 r487   3.8599999           0           0           0
 r488   3.8699999           0           0           0
 r489   3.8800001           0           0           0
 r490   3.8900001           0           0           0
 r491   3.9000001           0           0           0
 r492   3.9100001           0           0           0
 r493   3.9200001           0           0           0
 r494   3.9300001           0           0           0
 r495   3.9400001           0           0           0
 r496        3.95           0           0           0
 r497        3.96           0           0           0
 r498        3.97           0           0           0
 r499        3.98           0           0           0
 r500        3.99           0           0           0
 r501           4           0           0           0
 r502   4.0100002           0           0           0
 r503        4.02           0           0           0
 r504   4.0300002           0           0           0
 r505        4.04           0           0           0
 r506   4.0500002           0           0           0
 r507   4.0599999           0           0           0
 r508   4.0700002           0           0           0
 r509   4.0799999           0           0           0
 r510   4.0900002           0           0           0
 r511   4.0999999           0           0           0
 r512   4.1100001           0           0           0
 r513   4.1199999           0           0           0
 r514   4.1300001           0           0           0
 r515   4.1399999           0           0           0
 r516   4.1500001           0           0           0
 r517   4.1599998           0           0           0
 r518   4.1700001           0           0           0
 r519   4.1799998           0           0           0
 r520   4.1900001           0           0           0
 r521   4.1999998           0           0           0
 r522        4.21           0           0           0
 r523   4.2199998           0           0           0
 r524        4.23           0           0           0
 r525   4.2399998           0           0           0
 r526        4.25           0           0           0
 r527   4.2600002           0           0           0
 r528        4.27           0           0           0
 r529   4.2800002           0           0           0
 r530        4.29           0           0           0
 r531   4.3000002           0           0           0
 r532   4.3099999           0           0           0
 r533   4.3200002           0           0           0
 r534   4.3299999           0           0           0
 r535   4.3400002           0           0           0
 r536   4.3499999           0           0           0
 r537   4.3600001           0           0           0
 r538   4.3699999           0           0           0
 r539   4.3800001           0           0           0
 r540   4.3899999           0           0           0
 r541   4.4000001           0           0           0
 r542   4.4099998           0           0           0
 r543   4.4200001           0           0           0
 r544   4.4299998           0           0           0
 r545   4.4400001           0           0           0
 r546   4.4499998           0           0           0
 r547        4.46           0           0           0
 r548   4.4699998           0           0           0
 r549        4.48           0           0           0
 r550   4.4899998           0           0           0
 r551         4.5           0           0           0
 r552   4.5100002           0           0           0
 r553        4.52           0           0           0
 r554   4.5300002           0           0           0
 r555        4.54           0           0           0
 r556   4.5500002           0           0           0
 r557   4.5599999           0           0           0
 r558   4.5700002           0           0           0
 r559   4.5799999           0           0           0
 r560   4.5900002           0           0           0
 r561   4.5999999           0           0           0
 r562   4.6100001           0           0           0
 r563   4.6199999           0           0           0
 r564   4.6300001           0           0           0
 r565   4.6399999           0           0           0
 r566   4.6500001           0           0           0
 r567   4.6599998           0           0           0
 r568   4.6700001           0           0           0
 r569   4.6799998           0           0           0
 r570   4.6900001           0           0           0
 r571   4.6999998           0           0           0
 r572        4.71           0           0           0
 r573   4.7199998           0           0           0
 r574        4.73           0           0           0
 r575   4.7399998           0           0           0
 r576        4.75           0           0           0
 r577   4.7600002           0           0           0
 r578        4.77           0           0           0
 r579   4.7800002           0           0           0
 r580        4.79           0           0           0
 r581   4.8000002           0           0           0
 r582   4.8099999           0           0           0
 r583   4.8200002           0           0           0
 r584   4.8299999           0           0           0
 r585   4.8400002           0           0           0
 r586   4.8499999           0           0           0
 r587   4.8600001           0           0           0
 r588   4.8699999           0           0           0
 r589   4.8800001           0           0           0
 r590   4.8899999           0           0           0
 r591   4.9000001           0           0           0
 r592   4.9099998           0           0           0
 r593   4.9200001           0           0           0
 r594   4.9299998           0           0           0
 r595   4.9400001           0           0           0
 r596   4.9499998           0           0           0
 r597        4.96           0           0           0
 r598   4.9699998           0           0           0
 r599        4.98           0           0           0
 r600   4.9899998           0           0           0
 r601           5           0           0           0
 r602   5.0100002           0           0           0
 r603        5.02           0           0           0
 r604   5.0300002           0           0           0
 r605        5.04           0           0           0
 r606   5.0500002           0           0           0
 r607   5.0599999           0           0           0
 r608   5.0700002           0           0           0
 r609   5.0799999           0           0           0
 r610   5.0900002           0           0           0
 r611   5.0999999           0           0           0
 r612   5.1100001           0           0           0
 r613   5.1199999           0           0           0
 r614   5.1300001           0           0           0
 r615   5.1399999           0           0           0
 r616   5.1500001           0           0           0
 r617   5.1599998           0           0           0
 r618   5.1700001           0           0           0
 r619   5.1799998           0           0           0
 r620   5.1900001           0           0           0
 r621   5.1999998           0           0           0
 r622        5.21           0           0           0
 r623   5.2199998           0           0           0
 r624        5.23           0           0           0
 r625   5.2399998           0           0           0
 r626        5.25           0           0           0
 r627   5.2600002           0           0           0
 r628        5.27           0           0           0
 r629   5.2800002           0           0           0
 r630        5.29           0           0           0
 r631   5.3000002           0           0           0
 r632   5.3099999           0           0           0
 r633   5.3200002           0           0           0
 r634   5.3299999           0           0           0
 r635   5.3400002           0           0           0
 r636   5.3499999           0           0           0
 r637   5.3600001           0           0           0
 r638   5.3699999           0           0           0
 r639   5.3800001           0           0           0
 r640   5.3899999           0           0           0
 r641   5.4000001           0           0           0
 r642   5.4099998           0           0           0
 r643   5.4200001           0           0           0
 r644   5.4299998           0           0           0
 r645   5.4400001           0           0           0
 r646   5.4499998           0           0           0
 r647        5.46           0           0           0
 r648   5.4699998           0           0           0
 r649        5.48           0           0           0
 r650   5.4899998           0           0           0
 r651         5.5           0           0           0
 r652   5.5100002           0           0           0
 r653        5.52           0           0           0
 r654   5.5300002           0           0           0
 r655        5.54           0           0           0
 r656   5.5500002           0           0           0
 r657   5.5599999           0           0           0
 r658   5.5700002           0           0           0
 r659   5.5799999           0           0           0
 r660   5.5900002           0           0           0
 r661   5.5999999           0           0           0
 r662   5.6100001           0           0           0
 r663   5.6199999           0           0           0
 r664   5.6300001           0           0           0
 r665   5.6399999           0           0           0
 r666   5.6500001           0           0           0
 r667   5.6599998           0           0           0
 r668   5.6700001           0           0           0
 r669   5.6799998           0           0           0
 r670   5.6900001           0           0           0
 r671   5.6999998           0           0           0
 r672        5.71           0           0           0
 r673   5.7199998           0           0           0
 r674        5.73           0           0           0
 r675   5.7399998           0           0           0
 r676        5.75           0           0           0
 r677   5.7600002           0           0           0
 r678        5.77           0           0           0
 r679   5.7800002           0           0           0
 r680        5.79           0           0           0
 r681   5.8000002           0           0           0
 r682   5.8099999           0           0           0
 r683   5.8200002           0           0           0
 r684   5.8299999           0           0           0
 r685   5.8400002           0           0           0
 r686   5.8499999           0           0           0
 r687   5.8600001           0           0           0
 r688   5.8699999           0           0           0
 r689   5.8800001           0           0           0
 r690   5.8899999           0           0           0
 r691   5.9000001           0           0           0
 r692   5.9099998           0           0           0
 r693   5.9200001           0           0           0
 r694   5.9299998           0           0           0
 r695   5.9400001           0           0           0
 r696   5.9499998           0           0           0
 r697        5.96           0           0           0
 r698   5.9699998           0           0           0
 r699        5.98           0           0           0
 r700   5.9899998           0           0           0
 r701           6           0           0           0
 r702   6.0100002           0           0           0
 r703        6.02           0           0           0
 r704   6.0300002           0           0           0
 r705        6.04           0           0           0
 r706   6.0500002           0           0           0
 r707   6.0599999           0           0           0
 r708   6.0700002           0           0           0
 r709   6.0799999           0           0           0
 r710   6.0900002           0           0           0
 r711   6.0999999           0           0           0
 r712   6.1100001           0           0           0
 r713   6.1199999           0           0           0
 r714   6.1300001           0           0           0
 r715   6.1399999           0           0           0
 r716   6.1500001           0           0           0
 r717   6.1599998           0           0           0
 r718   6.1700001           0           0           0
 r719   6.1799998           0           0           0
 r720   6.1900001           0           0           0
 r721   6.1999998           0           0           0
 r722        6.21           0           0           0
 r723   6.2199998           0           0           0
 r724        6.23           0           0           0
 r725   6.2399998           0           0           0
 r726        6.25           0           0           0
 r727   6.2600002           0           0           0
 r728        6.27           0           0           0
 r729   6.2800002           0           0           0
 r730        6.29           0           0           0
 r731   6.3000002           0           0           0
 r732   6.3099999           0           0           0
 r733   6.3200002           0           0           0
 r734   6.3299999           0           0           0
 r735   6.3400002           0           0           0
 r736   6.3499999           0           0           0
 r737   6.3600001           0           0           0
 r738   6.3699999           0           0           0
 r739   6.3800001           0           0           0
 r740   6.3899999           0           0           0
 r741   6.4000001           0           0           0
 r742   6.4099998           0           0           0
 r743   6.4200001           0           0           0
 r744   6.4299998           0           0           0
 r745   6.4400001           0           0           0
 r746   6.4499998           0           0           0
 r747        6.46           0           0           0
 r748   6.4699998           0           0           0
 r749        6.48           0           0           0
 r750   6.4899998           0           0           0
 r751         6.5           0           0           0
 r752   6.5100002           0           0           0
 r753        6.52           0           0           0
 r754   6.5300002           0           0           0
 r755        6.54           0           0           0
 r756   6.5500002           0           0           0
 r757   6.5599999           0           0           0
 r758   6.5700002           0           0           0
 r759   6.5799999           0           0           0
 r760   6.5900002           0           0           0
 r761   6.5999999           0           0           0
 r762   6.6100001           0           0           0
 r763   6.6199999           0           0           0
 r764   6.6300001           0           0           0
 r765   6.6399999           0           0           0
 r766   6.6500001           0           0           0
 r767   6.6599998           0           0           0
 r768   6.6700001           0           0           0
 r769   6.6799998           0           0           0
 r770   6.6900001           0           0           0
 r771   6.6999998           0           0           0
 r772        6.71           0           0           0
 r773   6.7199998           0           0           0
 r774        6.73           0           0           0
 r775   6.7399998           0           0           0
 r776        6.75           0           0           0
 r777   6.7600002           0           0           0
 r778        6.77           0           0           0
 r779   6.7800002           0           0           0
 r780        6.79           0           0           0
 r781   6.8000002           0           0           0
 r782   6.8099999           0           0           0
 r783   6.8200002           0           0           0
 r784   6.8299999           0           0           0
 r785   6.8400002           0           0           0
 r786   6.8499999           0           0           0
 r787   6.8600001           0           0           0
 r788   6.8699999           0           0           0
 r789   6.8800001           0           0           0
 r790   6.8899999           0           0           0
 r791   6.9000001           0           0           0
 r792   6.9099998           0           0           0
 r793   6.9200001           0           0           0
 r794   6.9299998           0           0           0
 r795   6.9400001           0           0           0
 r796   6.9499998           0           0           0
 r797        6.96           0           0           0
 r798   6.9699998           0           0           0
 r799        6.98           0           0           0
 r800   6.9899998           0           0           0
 r801           7           0           0           0
 r802   7.0100002           0           0           0
 r803        7.02           0           0           0
 r804   7.0300002           0           0           0
 r805        7.04           0           0           0
 r806   7.0500002           0           0           0
 r807   7.0599999           0           0           0
 r808   7.0700002           0           0           0
 r809   7.0799999           0           0           0
 r810   7.0900002           0           0           0
 r811   7.0999999           0           0           0
 r812   7.1100001           0           0           0
 r813   7.1199999           0           0           0
 r814   7.1300001           0           0           0
 r815   7.1399999           0           0           0
 r816   7.1500001           0           0           0
 r817   7.1599998           0           0           0
 r818   7.1700001           0           0           0
 r819   7.1799998           0           0           0
 r820   7.1900001           0           0           0
 r821   7.1999998           0           0           0
 r822        7.21           0           0           0
 r823   7.2199998           0           0           0
 r824        7.23           0           0           0
 r825   7.2399998           0           0           0
 r826        7.25           0           0           0
 r827   7.2600002           0           0           0
 r828        7.27           0           0           0
 r829   7.2800002           0           0           0
 r830        7.29           0           0           0
 r831   7.3000002           0           0           0
 r832   7.3099999           0           0           0
 r833   7.3200002           0           0           0
 r834   7.3299999           0           0           0
 r835   7.3400002           0           0           0
 r836   7.3499999           0           0           0
 r837   7.3600001           0           0           0
 r838   7.3699999           0           0           0
 r839   7.3800001           0           0           0
 r840   7.3899999           0           0           0
 r841   7.4000001           0           0           0
 r842   7.4099998           0           0           0
 r843   7.4200001           0           0           0
 r844   7.4299998           0           0           0
 r845   7.4400001           0           0           0
 r846   7.4499998           0           0           0
 r847        7.46           0           0           0
 r848   7.4699998           0           0           0
 r849        7.48           0           0           0
 r850   7.4899998           0           0           0
 r851         7.5           0           0           0
 r852   7.5100002           0           0           0
 r853        7.52           0           0           0
 r854   7.5300002           0           0           0
 r855        7.54           0           0           0
 r856   7.5500002           0           0           0
 r857   7.5599999           0           0           0
 r858   7.5700002           0           0           0
 r859   7.5799999           0           0           0
 r860   7.5900002           0           0           0
 r861   7.5999999           0           0           0
 r862   7.6100001           0           0           0
 r863   7.6199999           0           0           0
 r864   7.6300001           0           0           0
 r865   7.6399999           0           0           0
 r866   7.6500001           0           0           0
 r867   7.6599998           0           0           0
 r868   7.6700001           0           0           0
 r869   7.6799998           0           0           0
 r870   7.6900001           0           0           0
 r871   7.6999998           0           0           0
 r872        7.71           0           0           0
 r873   7.7199998           0           0           0
 r874        7.73           0           0           0
 r875   7.7399998           0           0           0
 r876        7.75           0           0           0
 r877   7.7600002           0           0           0
 r878        7.77           0           0           0
 r879   7.7800002           0           0           0
 r880        7.79           0           0           0
 r881   7.8000002           0           0           0
 r882   7.8099999           0           0           0
 r883   7.8200002           0           0           0
 r884   7.8299999           0           0           0
 r885   7.8400002           0           0           0
 r886   7.8499999           0           0           0
 r887   7.8600001           0           0           0
 r888   7.8699999           0           0           0
 r889   7.8800001           0           0           0
 r890   7.8899999           0           0           0
 r891   7.9000001           0           0           0
 r892   7.9099998           0           0           0
 r893   7.9200001           0           0           0
 r894   7.9299998           0           0           0
 r895   7.9400001           0           0           0
 r896   7.9499998           0           0           0
 r897        7.96           0           0           0
 r898   7.9699998           0           0           0
 r899        7.98           0           0           0
 r900   7.9899998           0           0           0
 r901           8           0           0           0
 r902   8.0100002           0           0           0
 r903   8.0200005           0           0           0
 r904   8.0299997           0           0           0
 r905        8.04           0           0           0
 r906   8.0500002           0           0           0
 r907   8.0600004           0           0           0
 r908   8.0699997           0           0           0
 r909   8.0799999           0           0           0
 r910   8.0900002           0           0           0
 r911   8.1000004           0           0           0
 r912   8.1099997           0           0           0
 r913   8.1199999           0           0           0
 r914   8.1300001           0           0           0
 r915   8.1400003           0           0           0
 r916   8.1499996           0           0           0
 r917   8.1599998           0           0           0
 r918   8.1700001           0           0           0
 r919   8.1800003           0           0           0
 r920   8.1899996           0           0           0
 r921   8.1999998           0           0           0
 r922        8.21           0           0           0
 r923   8.2200003           0           0           0
 r924   8.2299995           0           0           0
 r925   8.2399998           0           0           0
 r926        8.25           0           0           0
 r927   8.2600002           0           0           0
 r928   8.2700005           0           0           0
 r929   8.2799997           0           0           0
 r930        8.29           0           0           0
 r931   8.3000002           0           0           0
 r932   8.3100004           0           0           0
 r933   8.3199997           0           0           0
 r934   8.3299999           0           0           0
 r935   8.3400002           0           0           0
 r936   8.3500004           0           0           0
 r937   8.3599997           0           0           0
 r938   8.3699999           0           0           0
 r939   8.3800001           0           0           0
 r940   8.3900003           0           0           0
 r941   8.3999996           0           0           0
 r942   8.4099998           0           0           0
 r943   8.4200001           0           0           0
 r944   8.4300003           0           0           0
 r945   8.4399996           0           0           0
 r946   8.4499998           0           0           0
 r947        8.46           0           0           0
 r948   8.4700003           0           0           0
 r949   8.4799995           0           0           0
 r950   8.4899998           0           0           0
 r951         8.5           0           0           0
 r952   8.5100002           0           0           0
 r953   8.5200005           0           0           0
 r954   8.5299997           0           0           0
 r955        8.54           0           0           0
 r956   8.5500002           0           0           0
 r957   8.5600004           0           0           0
 r958   8.5699997           0           0           0
 r959   8.5799999           0           0           0
 r960   8.5900002           0           0           0
 r961   8.6000004           0           0           0
 r962   8.6099997           0           0           0
 r963   8.6199999           0           0           0
 r964   8.6300001           0           0           0
 r965   8.6400003           0           0           0
 r966   8.6499996           0           0           0
 r967   8.6599998           0           0           0
 r968   8.6700001           0           0           0
 r969   8.6800003           0           0           0
 r970   8.6899996           0           0           0
 r971   8.6999998           0           0           0
 r972        8.71           0           0           0
 r973   8.7200003           0           0           0
 r974   8.7299995           0           0           0
 r975   8.7399998           0           0           0
 r976        8.75           0           0           0
 r977   8.7600002           0           0           0
 r978   8.7700005           0           0           0
 r979   8.7799997           0           0           0
 r980        8.79           0           0           0
 r981   8.8000002           0           0           0
 r982   8.8100004           0           0           0
 r983   8.8199997           0           0           0
 r984   8.8299999           0           0           0
 r985   8.8400002           0           0           0
 r986   8.8500004           0           0           0
 r987   8.8599997           0           0           0
 r988   8.8699999           0           0           0
 r989   8.8800001           0           0           0
 r990   8.8900003           0           0           0
 r991   8.8999996           0           0           0
 r992   8.9099998           0           0           0
 r993   8.9200001           0           0           0
 r994   8.9300003           0           0           0
 r995   8.9399996           0           0           0
 r996   8.9499998           0           0           0
 r997        8.96           0           0           0
 r998   8.9700003           0           0           0
 r999   8.9799995           0           0           0
r1000   8.9899998           0           0           0
r1001           9           0           0           0
r1002   9.0100002           0           0           0
r1003   9.0200005           0           0           0
r1004   9.0299997           0           0           0
r1005        9.04           0           0           0
r1006   9.0500002           0           0           0
r1007   9.0600004           0           0           0
r1008   9.0699997           0           0           0
r1009   9.0799999           0           0           0
r1010   9.0900002           0           0           0
r1011   9.1000004           0           0           0
r1012   9.1099997           0           0           0
r1013   9.1199999           0           0           0
r1014   9.1300001           0           0           0
r1015   9.1400003           0           0           0
r1016   9.1499996           0           0           0
r1017   9.1599998           0           0           0
r1018   9.1700001           0           0           0
r1019   9.1800003           0           0           0
r1020   9.1899996           0           0           0
r1021   9.1999998           0           0           0
r1022        9.21           0           0           0
r1023   9.2200003           0           0           0
r1024   9.2299995           0           0           0
r1025   9.2399998           0           0           0
r1026        9.25           0           0           0
r1027   9.2600002           0           0           0
r1028   9.2700005           0           0           0
r1029   9.2799997           0           0           0
r1030        9.29           0           0           0
r1031   9.3000002           0           0           0
r1032   9.3100004           0           0           0
r1033   9.3199997           0           0           0
r1034   9.3299999           0           0           0
r1035   9.3400002           0           0           0
r1036   9.3500004           0           0           0
r1037   9.3599997           0           0           0
r1038   9.3699999           0           0           0
r1039   9.3800001           0           0           0
r1040   9.3900003           0           0           0
r1041   9.3999996           0           0           0
r1042   9.4099998           0           0           0
r1043   9.4200001           0           0           0
r1044   9.4300003           0           0           0
r1045   9.4399996           0           0           0
r1046   9.4499998           0           0           0
r1047        9.46           0           0           0
r1048   9.4700003           0           0           0
r1049   9.4799995           0           0           0
r1050   9.4899998           0           0           0
r1051         9.5           0           0           0
r1052   9.5100002           0           0           0
r1053   9.5200005           0           0           0
r1054   9.5299997           0           0           0
r1055        9.54           0           0           0
r1056   9.5500002           0           0           0
r1057   9.5600004           0           0           0
r1058   9.5699997           0           0           0
r1059   9.5799999           0           0           0
r1060   9.5900002           0           0           0
r1061   9.6000004           0           0           0
r1062   9.6099997           0           0           0
r1063   9.6199999           0           0           0
r1064   9.6300001           0           0           0
r1065   9.6400003           0           0           0
r1066   9.6499996           0           0           0
r1067   9.6599998           0           0           0
r1068   9.6700001           0           0           0
r1069   9.6800003           0           0           0
r1070   9.6899996           0           0           0
r1071   9.6999998           0           0           0
r1072        9.71           0           0           0
r1073   9.7200003           0           0           0
r1074   9.7299995           0           0           0
r1075   9.7399998           0           0           0
r1076        9.75           0           0           0
r1077   9.7600002           0           0           0
r1078   9.7700005           0           0           0
r1079   9.7799997           0           0           0
r1080        9.79           0           0           0
r1081   9.8000002           0           0           0
r1082   9.8100004           0           0           0
r1083   9.8199997           0           0           0
r1084   9.8299999           0           0           0
r1085   9.8400002           0           0           0
r1086   9.8500004           0           0           0
r1087   9.8599997           0           0           0
r1088   9.8699999           0           0           0
r1089   9.8800001           0           0           0
r1090   9.8900003           0           0           0
r1091   9.8999996           0           0           0
r1092   9.9099998           0           0           0
r1093   9.9200001           0           0           0
r1094   9.9300003           0           0           0
r1095   9.9399996           0           0           0
r1096   9.9499998           0           0           0
r1097        9.96           0           0           0
r1098   9.9700003           0           0           0
r1099   9.9799995           0           0           0
r1100   9.9899998           0           0           0
r1101          10           0           0           0
r1102       10.01           0           0           0
r1103       10.02           0           0           0
r1104       10.03           0           0           0
r1105       10.04           0           0           0
r1106       10.05           0           0           0
r1107       10.06           0           0           0
r1108       10.07           0           0           0
r1109       10.08           0           0           0
r1110       10.09           0           0           0
r1111        10.1           0           0           0
r1112       10.11           0           0           0
r1113       10.12           0           0           0
r1114       10.13           0           0           0
r1115       10.14           0           0           0
r1116       10.15           0           0           0
r1117       10.16           0           0           0
r1118       10.17           0           0           0
r1119       10.18           0           0           0
r1120       10.19           0           0           0
r1121        10.2           0           0           0
r1122       10.21           0           0           0
r1123       10.22           0           0           0
r1124       10.23           0           0           0
r1125       10.24           0           0           0
r1126       10.25           0           0           0
r1127       10.26           0           0           0
r1128       10.27           0           0           0
r1129       10.28           0           0           0
r1130       10.29           0           0           0
r1131        10.3           0           0           0
r1132       10.31           0           0           0
r1133       10.32           0           0           0
r1134       10.33           0           0           0
r1135       10.34           0           0           0
r1136       10.35           0           0           0
r1137       10.36           0           0           0
r1138       10.37           0           0           0
r1139       10.38           0           0           0
r1140       10.39           0           0           0
r1141        10.4           0           0           0
r1142       10.41           0           0           0
r1143       10.42           0           0           0
r1144       10.43           0           0           0
r1145       10.44           0           0           0
r1146       10.45           0           0           0
r1147       10.46           0           0           0
r1148       10.47           0           0           0
r1149       10.48           0           0           0
r1150       10.49           0           0           0
r1151        10.5           0           0           0
r1152       10.51           0           0           0
r1153       10.52           0           0           0
r1154       10.53           0           0           0
r1155       10.54           0           0           0
r1156       10.55           0           0           0
r1157       10.56           0           0           0
r1158       10.57           0           0           0
r1159       10.58           0           0           0
r1160       10.59           0           0           0
r1161        10.6           0           0           0
r1162       10.61           0           0           0
r1163       10.62           0           0           0
r1164       10.63           0           0           0
r1165       10.64           0           0           0
r1166       10.65           0           0           0
r1167       10.66           0           0           0
r1168       10.67           0           0           0
r1169       10.68           0           0           0
r1170       10.69           0           0           0
r1171        10.7           0           0           0
r1172       10.71           0           0           0
r1173       10.72           0           0           0
r1174       10.73           0           0           0
r1175       10.74           0           0           0
r1176       10.75           0           0           0
r1177       10.76           0           0           0
r1178       10.77           0           0           0
r1179       10.78           0           0           0
r1180       10.79           0           0           0
r1181        10.8           0           0           0
r1182       10.81           0           0           0
r1183       10.82           0           0           0
r1184       10.83           0           0           0
r1185       10.84           0           0           0
r1186       10.85           0           0           0
r1187       10.86           0           0           0
r1188       10.87           0           0           0
r1189       10.88           0           0           0
r1190       10.89           0           0           0
r1191        10.9           0           0           0
r1192       10.91           0           0           0
r1193       10.92           0           0           0
r1194       10.93           0           0           0
r1195       10.94           0           0           0
r1196       10.95           0           0           0
r1197       10.96           0           0           0
r1198       10.97           0           0           0
r1199       10.98           0           0           0
r1200       10.99           0           0           0
r1201          11           0           0           0
r1202       11.01           0           0           0
r1203       11.02           0           0           0
r1204       11.03           0           0           0
r1205       11.04           0           0           0
r1206       11.05           0           0           0
r1207       11.06           0           0           0
r1208       11.07           0           0           0
r1209       11.08           0           0           0
r1210       11.09           0           0           0
r1211        11.1           0           0           0
r1212       11.11           0           0           0
r1213       11.12           0           0           0
r1214       11.13           0           0           0
r1215       11.14           0           0           0
r1216       11.15           0           0           0
r1217       11.16           0           0           0
r1218       11.17           0           0           0
r1219       11.18           0           0           0
r1220       11.19           0           0           0
r1221        11.2           0           0           0
r1222       11.21           0           0           0
r1223       11.22           0           0           0
r1224       11.23           0           0           0
r1225       11.24           0           0           0
r1226       11.25           0           0           0
r1227       11.26           0           0           0
r1228       11.27           0           0           0
r1229       11.28           0           0           0
r1230       11.29           0           0           0
r1231        11.3           0           0           0
r1232       11.31           0           0           0
r1233       11.32           0           0           0
r1234       11.33           0           0           0
r1235       11.34           0           0           0
r1236       11.35           0           0           0
r1237       11.36           0           0           0
r1238       11.37           0           0           0
r1239       11.38           0           0           0
r1240       11.39           0           0           0
r1241        11.4           0           0           0
r1242       11.41           0           0           0
r1243       11.42           0           0           0
r1244       11.43           0           0           0
r1245       11.44           0           0           0
r1246       11.45           0           0           0
r1247       11.46           0           0           0
r1248       11.47           0           0           0
r1249       11.48           0           0           0
r1250       11.49           0           0           0
r1251        11.5           0           0           0
r1252       11.51           0           0           0
r1253       11.52           0           0           0
r1254       11.53           0           0           0
r1255       11.54           0           0           0
r1256       11.55           0           0           0
r1257       11.56           0           0           0
r1258       11.57           0           0           0
r1259       11.58           0           0           0
r1260       11.59           0           0           0
r1261        11.6           0           0           0
r1262       11.61           0           0           0
r1263       11.62           0           0           0
r1264       11.63           0           0           0
r1265       11.64           0           0           0
r1266       11.65           0           0           0
r1267       11.66           0           0           0
r1268       11.67           0           0           0
r1269       11.68           0           0           0
r1270       11.69           0           0           0
r1271        11.7           0           0           0
r1272       11.71           0           0           0
r1273       11.72           0           0           0
r1274       11.73           0           0           0
r1275       11.74           0           0           0
r1276       11.75           0           0           0
r1277       11.76           0           0           0
r1278       11.77           0           0           0
r1279       11.78           0           0           0
r1280       11.79           0           0           0
r1281        11.8           0           0           0
r1282       11.81           0           0           0
r1283       11.82           0           0           0
r1284       11.83           0           0           0
r1285       11.84           0           0           0
r1286       11.85           0           0           0
r1287       11.86           0           0           0
r1288       11.87           0           0           0
r1289       11.88           0           0           0
r1290       11.89           0           0           0
r1291        11.9           0           0           0
r1292       11.91           0           0           0
r1293       11.92           0           0           0
r1294       11.93           0           0           0
r1295       11.94           0           0           0
r1296       11.95           0           0           0
r1297       11.96           0           0           0
r1298       11.97           0           0           0
r1299       11.98           0           0           0
r1300       11.99           0           0           0
r1301          12           0           0           0
r1302       12.01           0           0           0
r1303       12.02           0           0           0
r1304       12.03           0           0           0
r1305       12.04           0           0           0
r1306       12.05           0           0           0
r1307       12.06           0           0           0
r1308       12.07           0           0           0
r1309       12.08           0           0           0
r1310       12.09           0           0           0
r1311        12.1           0           0           0
r1312       12.11           0           0           0
r1313       12.12           0           0           0
r1314       12.13           0           0           0
r1315       12.14           0           0           0
r1316       12.15           0           0           0
r1317       12.16           0           0           0
r1318       12.17           0           0           0
r1319       12.18           0           0           0
r1320       12.19           0           0           0
r1321        12.2           0           0           0
r1322       12.21           0           0           0
r1323       12.22           0           0           0
r1324       12.23           0           0           0
r1325       12.24           0           0           0
r1326       12.25           0           0           0
r1327       12.26           0           0           0
r1328       12.27           0           0           0
r1329       12.28           0           0           0
r1330       12.29           0           0           0
r1331        12.3           0           0           0
r1332       12.31           0           0           0
r1333       12.32           0           0           0
r1334       12.33           0           0           0
r1335       12.34           0           0           0
r1336       12.35           0           0           0
r1337       12.36           0           0           0
r1338       12.37           0           0           0
r1339       12.38           0           0           0
r1340       12.39           0           0           0
r1341        12.4           0           0           0
r1342       12.41           0           0           0
r1343       12.42           0           0           0
r1344       12.43           0           0           0
r1345       12.44           0           0           0
r1346       12.45           0           0           0
r1347       12.46           0           0           0
r1348       12.47           0           0           0
r1349       12.48           0           0           0
r1350       12.49           0           0           0
r1351        12.5           0           0           0
r1352       12.51           0           0           0
r1353       12.52           0           0           0
r1354       12.53           0           0           0
r1355       12.54           0           0           0
r1356       12.55           0           0           0
r1357       12.56           0           0           0
r1358       12.57           0           0           0
r1359       12.58           0           0           0
r1360       12.59           0           0           0
r1361        12.6           0           0           0
r1362       12.61           0           0           0
r1363       12.62           0           0           0
r1364       12.63           0           0           0
r1365       12.64           0           0           0
r1366       12.65           0           0           0
r1367       12.66           0           0           0
r1368       12.67           0           0           0
r1369       12.68           0           0           0
r1370       12.69           0           0           0
r1371        12.7           0           0           0
r1372       12.71           0           0           0
r1373       12.72           0           0           0
r1374       12.73           0           0           0
r1375       12.74           0           0           0
r1376       12.75           0           0           0
r1377       12.76           0           0           0
r1378       12.77           0           0           0
r1379       12.78           0           0           0
r1380       12.79           0           0           0
r1381        12.8           0           0           0
r1382       12.81           0           0           0
r1383       12.82           0           0           0
r1384       12.83           0           0           0
r1385       12.84           0           0           0
r1386       12.85           0           0           0
r1387       12.86           0           0           0
r1388       12.87           0           0           0
r1389       12.88           0           0           0
r1390       12.89           0           0           0
r1391        12.9           0           0           0
r1392       12.91           0           0           0
r1393       12.92           0           0           0
r1394       12.93           0           0           0
r1395       12.94           0           0           0
r1396       12.95           0           0           0
r1397       12.96           0           0           0
r1398       12.97           0           0           0
r1399       12.98           0           0           0
r1400       12.99           0           0           0
r1401          13           0           0           0
r1402       13.01           0           0           0
r1403       13.02           0           0           0
r1404       13.03           0           0           0
r1405       13.04           0           0           0
r1406       13.05           0           0           0
r1407       13.06           0           0           0
r1408       13.07           0           0           0
r1409       13.08           0           0           0
r1410       13.09           0           0           0
r1411        13.1           0           0           0
r1412       13.11           0           0           0
r1413       13.12           0           0           0
r1414       13.13           0           0           0
r1415       13.14           0           0           0
r1416       13.15           0           0           0
r1417       13.16           0           0           0
r1418       13.17           0           0           0
r1419       13.18           0           0           0
r1420       13.19           0           0           0
r1421        13.2           0           0           0
r1422       13.21           0           0           0
r1423       13.22           0           0           0
r1424       13.23           0           0           0
r1425       13.24           0           0           0
r1426       13.25           0           0           0
r1427       13.26           0           0           0
r1428       13.27           0           0           0
r1429       13.28           0           0           0
r1430       13.29           0           0           0
r1431        13.3           0           0           0
r1432       13.31           0           0           0
r1433       13.32           0           0           0
r1434       13.33           0           0           0
r1435       13.34           0           0           0
r1436       13.35           0           0           0
r1437       13.36           0           0           0
r1438       13.37           0           0           0
r1439       13.38           0           0           0
r1440       13.39           0           0           0
r1441        13.4           0           0           0
r1442       13.41           0           0           0
r1443       13.42           0           0           0
r1444       13.43           0           0           0
r1445       13.44           0           0           0
r1446       13.45           0           0           0
r1447       13.46           0           0           0
r1448       13.47           0           0           0
r1449       13.48           0           0           0
r1450       13.49           0           0           0
r1451        13.5           0           0           0
r1452       13.51           0           0           0
r1453       13.52           0           0           0
r1454       13.53           0           0           0
r1455       13.54           0           0           0
r1456       13.55           0           0           0
r1457       13.56           0           0           0
r1458       13.57           0           0           0
r1459       13.58           0           0           0
r1460       13.59           0           0           0
r1461        13.6           0           0           0
r1462       13.61           0           0           0
r1463       13.62           0           0           0
r1464       13.63           0           0           0
r1465       13.64           0           0           0
r1466       13.65           0           0           0
r1467       13.66           0           0           0
r1468       13.67           0           0           0
r1469       13.68           0           0           0
r1470       13.69           0           0           0
r1471        13.7           0           0           0
r1472       13.71           0           0           0
r1473       13.72           0           0           0
r1474       13.73           0           0           0
r1475       13.74           0           0           0
r1476       13.75           0           0           0
r1477       13.76           0           0           0
r1478       13.77           0           0           0
r1479       13.78           0           0           0
r1480       13.79           0           0           0
r1481        13.8           0           0           0
r1482       13.81           0           0           0
r1483       13.82           0           0           0
r1484       13.83           0           0           0
r1485       13.84           0           0           0
r1486       13.85           0           0           0
r1487       13.86           0           0           0
r1488       13.87           0           0           0
r1489       13.88           0           0           0
r1490       13.89           0           0           0
r1491        13.9           0           0           0
r1492       13.91           0           0           0
r1493       13.92           0           0           0
r1494       13.93           0           0           0
r1495       13.94           0           0           0
r1496       13.95           0           0           0
r1497       13.96           0           0           0
r1498       13.97           0           0           0
r1499       13.98           0           0           0
r1500       13.99           0           0           0
r1501          14           0           0           0
r1502       14.01           0           0           0
r1503       14.02           0           0           0
r1504       14.03           0           0           0
r1505       14.04           0           0           0
r1506       14.05           0           0           0
r1507       14.06           0           0           0
r1508       14.07           0           0           0
r1509       14.08           0           0           0
r1510       14.09           0           0           0
r1511        14.1           0           0           0
r1512       14.11           0           0           0
r1513       14.12           0           0           0
r1514       14.13           0           0           0
r1515       14.14           0           0           0
r1516       14.15           0           0           0
r1517       14.16           0           0           0
r1518       14.17           0           0           0
r1519       14.18           0           0           0
r1520       14.19           0           0           0
r1521        14.2           0           0           0
r1522       14.21           0           0           0
r1523       14.22           0           0           0
r1524       14.23           0           0           0
r1525       14.24           0           0           0
r1526       14.25           0           0           0
r1527       14.26           0           0           0
r1528       14.27           0           0           0
r1529       14.28           0           0           0
r1530       14.29           0           0           0
r1531        14.3           0           0           0
r1532       14.31           0           0           0
r1533       14.32           0           0           0
r1534       14.33           0           0           0
r1535       14.34           0           0           0
r1536       14.35           0           0           0
r1537       14.36           0           0           0
r1538       14.37           0           0           0
r1539       14.38           0           0           0
r1540       14.39           0           0           0
r1541        14.4           0           0           0
r1542       14.41           0           0           0
r1543       14.42           0           0           0
r1544       14.43           0           0           0
r1545       14.44           0           0           0
r1546       14.45           0           0           0
r1547       14.46           0           0           0
r1548       14.47           0           0           0
r1549       14.48           0           0           0
r1550       14.49           0           0           0
r1551        14.5           0           0           0
r1552       14.51           0           0           0
r1553       14.52           0           0           0
r1554       14.53           0           0           0
r1555       14.54           0           0           0
r1556       14.55           0           0           0
r1557       14.56           0           0           0
r1558       14.57           0           0           0
r1559       14.58           0           0           0
r1560       14.59           0           0           0
r1561        14.6           0           0           0
r1562       14.61           0           0           0
r1563       14.62           0           0           0
r1564       14.63           0           0           0
r1565       14.64           0           0           0
r1566       14.65           0           0           0
r1567       14.66           0           0           0
r1568       14.67           0           0           0
r1569       14.68           0           0           0
r1570       14.69           0           0           0
r1571        14.7           0           0           0
r1572       14.71           0           0           0
r1573       14.72           0           0           0
r1574       14.73           0           0           0
r1575       14.74           0           0           0
r1576       14.75           0           0           0
r1577       14.76           0           0           0
r1578       14.77           0           0           0
r1579       14.78           0           0           0
r1580       14.79           0           0           0
r1581        14.8           0           0           0
r1582       14.81           0           0           0
r1583       14.82           0           0           0
r1584       14.83           0           0           0
r1585       14.84           0           0           0
r1586       14.85           0           0           0
r1587       14.86           0           0           0
r1588       14.87           0           0           0
r1589       14.88           0           0           0
r1590       14.89           0           0           0
r1591        14.9           0           0           0
r1592       14.91           0           0           0
r1593       14.92           0           0           0
r1594       14.93           0           0           0
r1595       14.94           0           0           0
r1596       14.95           0           0           0
r1597       14.96           0           0           0
r1598       14.97           0           0           0
r1599       14.98           0           0           0
r1600       14.99           0           0           0
r1601          15           0           0           0
r1602       15.01           0           0           0
r1603       15.02           0           0           0
r1604       15.03           0           0           0
r1605       15.04           0           0           0
r1606       15.05           0           0           0
r1607       15.06           0           0           0
r1608       15.07           0           0           0
r1609       15.08           0           0           0
r1610       15.09           0           0           0
r1611        15.1           0           0           0
r1612       15.11           0           0           0
r1613       15.12           0           0           0
r1614       15.13           0           0           0
r1615       15.14           0           0           0
r1616       15.15           0           0           0
r1617       15.16           0           0           0
r1618       15.17           0           0           0
r1619       15.18           0           0           0
r1620       15.19           0           0           0
r1621        15.2           0           0           0
r1622       15.21           0           0           0
r1623       15.22           0           0           0
r1624       15.23           0           0           0
r1625       15.24           0           0           0
r1626       15.25           0           0           0
r1627       15.26           0           0           0
r1628       15.27           0           0           0
r1629       15.28           0           0           0
r1630       15.29           0           0           0
r1631        15.3           0           0           0
r1632       15.31           0           0           0
r1633       15.32           0           0           0
r1634       15.33           0           0           0
r1635       15.34           0           0           0
r1636       15.35           0           0           0
r1637       15.36           0           0           0
r1638       15.37           0           0           0
r1639       15.38           0           0           0
r1640       15.39           0           0           0
r1641        15.4           0           0           0
r1642       15.41           0           0           0
r1643       15.42           0           0           0
r1644       15.43           0           0           0
r1645       15.44           0           0           0
r1646       15.45           0           0           0
r1647       15.46           0           0           0
r1648       15.47           0           0           0
r1649       15.48           0           0           0
r1650       15.49           0           0           0
r1651        15.5           0           0           0
r1652       15.51           0           0           0
r1653       15.52           0           0           0
r1654       15.53           0           0           0
r1655       15.54           0           0           0
r1656       15.55           0           0           0
r1657       15.56           0           0           0
r1658       15.57           0           0           0
r1659       15.58           0           0           0
r1660       15.59           0           0           0
r1661        15.6           0           0           0
r1662       15.61           0           0           0
r1663       15.62           0           0           0
r1664       15.63           0           0           0
r1665       15.64           0           0           0
r1666       15.65           0           0           0
r1667       15.66           0           0           0
r1668       15.67           0           0           0
r1669       15.68           0           0           0
r1670       15.69           0           0           0
r1671        15.7           0           0           0
r1672       15.71           0           0           0
r1673       15.72           0           0           0
r1674       15.73           0           0           0
r1675       15.74           0           0           0
r1676       15.75           0           0           0
r1677       15.76           0           0           0
r1678       15.77           0           0           0
r1679       15.78           0           0           0
r1680       15.79           0           0           0
r1681        15.8           0           0           0
r1682       15.81           0           0           0
r1683       15.82           0           0           0
r1684       15.83           0           0           0
r1685       15.84           0           0           0
r1686       15.85           0           0           0
r1687       15.86           0           0           0
r1688       15.87           0           0           0
r1689       15.88           0           0           0
r1690       15.89           0           0           0
r1691        15.9           0           0           0
r1692       15.91           0           0           0
r1693       15.92           0           0           0
r1694       15.93           0           0           0
r1695       15.94           0           0           0
r1696       15.95           0           0           0
r1697       15.96           0           0           0
r1698       15.97           0           0           0
r1699       15.98           0           0           0
r1700       15.99           0           0           0
r1701          16           0           0           0
r1702       16.01           0           0           0
r1703       16.02           0           0           0
r1704   16.030001           0           0           0
r1705   16.040001           0           0           0
r1706   16.049999           0           0           0
r1707   16.059999           0           0           0
r1708       16.07           0           0           0
r1709       16.08           0           0           0
r1710       16.09           0           0           0
r1711        16.1           0           0           0
r1712   16.110001           0           0           0
r1713   16.120001           0           0           0
r1714   16.129999           0           0           0
r1715   16.139999           0           0           0
r1716       16.15           0           0           0
r1717       16.16           0           0           0
r1718       16.17           0           0           0
r1719       16.18           0           0           0
r1720   16.190001           0           0           0
r1721   16.200001           0           0           0
r1722   16.209999           0           0           0
r1723   16.219999           0           0           0
r1724       16.23           0           0           0
r1725       16.24           0           0           0
r1726       16.25           0           0           0
r1727       16.26           0           0           0
r1728       16.27           0           0           0
r1729   16.280001           0           0           0
r1730   16.290001           0           0           0
r1731   16.299999           0           0           0
r1732   16.309999           0           0           0
r1733       16.32           0           0           0
r1734       16.33           0           0           0
r1735       16.34           0           0           0
r1736       16.35           0           0           0
r1737   16.360001           0           0           0
r1738   16.370001           0           0           0
r1739   16.379999           0           0           0
r1740   16.389999           0           0           0
r1741        16.4           0           0           0
r1742       16.41           0           0           0
r1743       16.42           0           0           0
r1744       16.43           0           0           0
r1745   16.440001           0           0           0
r1746   16.450001           0           0           0
r1747   16.459999           0           0           0
r1748   16.469999           0           0           0
r1749       16.48           0           0           0
r1750       16.49           0           0           0
r1751        16.5           0           0           0
r1752       16.51           0           0           0
r1753       16.52           0           0           0
r1754   16.530001           0           0           0
r1755   16.540001           0           0           0
r1756   16.549999           0           0           0
r1757   16.559999           0           0           0
r1758       16.57           0           0           0
r1759       16.58           0           0           0
r1760       16.59           0           0           0
r1761        16.6           0           0           0
r1762   16.610001           0           0           0
r1763   16.620001           0           0           0
r1764   16.629999           0           0           0
r1765   16.639999           0           0           0
r1766       16.65           0           0           0
r1767       16.66           0           0           0
r1768       16.67           0           0           0
r1769       16.68           0           0           0
r1770   16.690001           0           0           0
r1771   16.700001           0           0           0
r1772   16.709999           0           0           0
r1773   16.719999           0           0           0
r1774       16.73           0           0           0
r1775       16.74           0           0           0
r1776       16.75           0           0           0
r1777       16.76           0           0           0
r1778       16.77           0           0           0
r1779   16.780001           0           0           0
r1780   16.790001           0           0           0
r1781   16.799999           0           0           0
r1782   16.809999           0           0           0
r1783       16.82           0           0           0
r1784       16.83           0           0           0
r1785       16.84           0           0           0
r1786       16.85           0           0           0
r1787   16.860001           0           0           0
r1788   16.870001           0           0           0
r1789   16.879999           0           0           0
r1790   16.889999           0           0           0
r1791        16.9           0           0           0
r1792       16.91           0           0           0
r1793       16.92           0           0           0
r1794       16.93           0           0           0
r1795   16.940001           0           0           0
r1796   16.950001           0           0           0
r1797   16.959999           0           0           0
r1798   16.969999           0           0           0
r1799       16.98           0           0           0
r1800       16.99           0           0           0
r1801          17           0           0           0
r1802       17.01           0           0           0
r1803       17.02           0           0           0
r1804   17.030001           0           0           0
r1805   17.040001           0           0           0
r1806   17.049999           0           0           0
r1807   17.059999           0           0           0
r1808       17.07           0           0           0
r1809       17.08           0           0           0
r1810       17.09           0           0           0
r1811        17.1           0           0           0
r1812   17.110001           0           0           0
r1813   17.120001           0           0           0
r1814   17.129999           0           0           0
r1815   17.139999           0           0           0
r1816       17.15           0           0           0
r1817       17.16           0           0           0
r1818       17.17           0           0           0
r1819       17.18           0           0           0
r1820   17.190001           0           0           0
r1821   17.200001           0           0           0
r1822   17.209999           0           0           0
r1823   17.219999           0           0           0
r1824       17.23           0           0           0
r1825       17.24           0           0           0
r1826       17.25           0           0           0
r1827       17.26           0           0           0
r1828       17.27           0           0           0
r1829   17.280001           0           0           0
r1830   17.290001           0           0           0
r1831   17.299999           0           0           0
r1832   17.309999           0           0           0
r1833       17.32           0           0           0
r1834       17.33           0           0           0
r1835       17.34           0           0           0
r1836       17.35           0           0           0
r1837   17.360001           0           0           0
r1838   17.370001           0           0           0
r1839   17.379999           0           0           0
r1840   17.389999           0           0           0
r1841        17.4           0           0           0
r1842       17.41           0           0           0
r1843       17.42           0           0           0
r1844       17.43           0           0           0
r1845   17.440001           0           0           0
r1846   17.450001           0           0           0
r1847   17.459999           0           0           0
r1848   17.469999           0           0           0
r1849       17.48           0           0           0
r1850       17.49           0           0           0
r1851        17.5           0           0           0
r1852       17.51           0           0           0
r1853       17.52           0           0           0
r1854   17.530001           0           0           0
r1855   17.540001           0           0           0
r1856   17.549999           0           0           0
r1857   17.559999           0           0           0
r1858       17.57           0           0           0
r1859       17.58           0           0           0
r1860       17.59           0           0           0
r1861        17.6           0           0           0
r1862   17.610001           0           0           0
r1863   17.620001           0           0           0
r1864   17.629999           0           0           0
r1865   17.639999           0           0           0
r1866       17.65           0           0           0
r1867       17.66           0           0           0
r1868       17.67           0           0           0
r1869       17.68           0           0           0
r1870   17.690001           0           0           0
r1871   17.700001           0           0           0
r1872   17.709999           0           0           0
r1873   17.719999           0           0           0
r1874       17.73           0           0           0
r1875       17.74           0           0           0
r1876       17.75           0           0           0
r1877       17.76           0           0           0
r1878       17.77           0           0           0
r1879   17.780001           0           0           0
r1880   17.790001           0           0           0
r1881   17.799999           0           0           0
r1882   17.809999           0           0           0
r1883       17.82           0           0           0
r1884       17.83           0           0           0
r1885       17.84           0           0           0
r1886       17.85           0           0           0
r1887   17.860001           0           0           0
r1888   17.870001           0           0           0
r1889   17.879999           0           0           0
r1890   17.889999           0           0           0
r1891        17.9           0           0           0
r1892       17.91           0           0           0
r1893       17.92           0           0           0
r1894       17.93           0           0           0
r1895   17.940001           0           0           0
r1896   17.950001           0           0           0
r1897   17.959999           0           0           0
r1898   17.969999           0           0           0
r1899       17.98           0           0           0
r1900       17.99           0           0           0
r1901          18           0           0           0
r1902       18.01           0           0           0
r1903       18.02           0           0           0
r1904   18.030001           0           0           0
r1905   18.040001           0           0           0
r1906   18.049999           0           0           0
r1907   18.059999           0           0           0
r1908       18.07           0           0           0
r1909       18.08           0           0           0
r1910       18.09           0           0           0
r1911        18.1           0           0           0
r1912   18.110001           0           0           0
r1913   18.120001           0           0           0
r1914   18.129999           0           0           0
r1915   18.139999           0           0           0
r1916       18.15           0           0           0
r1917       18.16           0           0           0
r1918       18.17           0           0           0
r1919       18.18           0           0           0
r1920   18.190001           0           0           0
r1921   18.200001           0           0           0
r1922   18.209999           0           0           0
r1923   18.219999           0           0           0
r1924       18.23           0           0           0
r1925       18.24           0           0           0
r1926       18.25           0           0           0
r1927       18.26           0           0           0
r1928       18.27           0           0           0
r1929   18.280001           0           0           0
r1930   18.290001           0           0           0
r1931   18.299999           0           0           0
r1932   18.309999           0           0           0
r1933       18.32           0           0           0
r1934       18.33           0           0           0
r1935       18.34           0           0           0
r1936       18.35           0           0           0
r1937   18.360001           0           0           0
r1938   18.370001           0           0           0
r1939   18.379999           0           0           0
r1940   18.389999           0           0           0
r1941        18.4           0           0           0
r1942       18.41           0           0           0
r1943       18.42           0           0           0
r1944       18.43           0           0           0
r1945   18.440001           0           0           0
r1946   18.450001           0           0           0
r1947   18.459999           0           0           0
r1948   18.469999           0           0           0
r1949       18.48           0           0           0
r1950       18.49           0           0           0
r1951        18.5           0           0           0
r1952       18.51           0           0           0
r1953       18.52           0           0           0
r1954   18.530001           0           0           0
r1955   18.540001           0           0           0
r1956   18.549999           0           0           0
r1957   18.559999           0           0           0
r1958       18.57           0           0           0
r1959       18.58           0           0           0
r1960       18.59           0           0           0
r1961        18.6           0           0           0
r1962   18.610001           0           0           0
r1963   18.620001           0           0           0
r1964   18.629999           0           0           0
r1965   18.639999           0           0           0
r1966       18.65           0           0           0
r1967       18.66           0           0           0
r1968       18.67           0           0           0
r1969       18.68           0           0           0
r1970   18.690001           0           0           0
r1971   18.700001           0           0           0
r1972   18.709999           0           0           0
r1973   18.719999           0           0           0
r1974       18.73           0           0           0
r1975       18.74           0           0           0
r1976       18.75           0           0           0
r1977       18.76           0           0           0
r1978       18.77           0           0           0
r1979   18.780001           0           0           0
r1980   18.790001           0           0           0
r1981   18.799999           0           0           0
r1982   18.809999           0           0           0
r1983       18.82           0           0           0
r1984       18.83           0           0           0
r1985       18.84           0           0           0
r1986       18.85           0           0           0
r1987   18.860001           0           0           0
r1988   18.870001           0           0           0
r1989   18.879999           0           0           0
r1990   18.889999           0           0           0
r1991        18.9           0           0           0
r1992       18.91           0           0           0
r1993       18.92           0           0           0
r1994       18.93           0           0           0
r1995   18.940001           0           0           0
r1996   18.950001           0           0           0
r1997   18.959999           0           0           0
r1998   18.969999           0           0           0
r1999       18.98           0           0           0
r2000       18.99           0           0           0
r2001          19           0           0           0
r2002       19.01           0           0           0
r2003       19.02           0           0           0
r2004   19.030001           0           0           0
r2005   19.040001           0           0           0
r2006   19.049999           0           0           0
r2007   19.059999           0           0           0
r2008       19.07           0           0           0
r2009       19.08           0           0           0
r2010       19.09           0           0           0
r2011        19.1           0           0           0
r2012   19.110001           0           0           0
r2013   19.120001           0           0           0
r2014   19.129999           0           0           0
r2015   19.139999           0           0           0
r2016       19.15           0           0           0
r2017       19.16           0           0           0
r2018       19.17           0           0           0
r2019       19.18           0           0           0
r2020   19.190001           0           0           0
r2021   19.200001           0           0           0
r2022   19.209999           0           0           0
r2023   19.219999           0           0           0
r2024       19.23           0           0           0
r2025       19.24           0           0           0
r2026       19.25           0           0           0
r2027       19.26           0           0           0
r2028       19.27           0           0           0
r2029   19.280001           0           0           0
r2030   19.290001           0           0           0
r2031   19.299999           0           0           0
r2032   19.309999           0           0           0
r2033       19.32           0           0           0
r2034       19.33           0           0           0
r2035       19.34           0           0           0
r2036       19.35           0           0           0
r2037   19.360001           0           0           0
r2038   19.370001           0           0           0
r2039   19.379999           0           0           0
r2040   19.389999           0           0           0
r2041        19.4           0           0           0
r2042       19.41           0           0           0
r2043       19.42           0           0           0
r2044       19.43           0           0           0
r2045   19.440001           0           0           0
r2046   19.450001           0           0           0
r2047   19.459999           0           0           0
r2048   19.469999           0           0           0
r2049       19.48           0           0           0
r2050       19.49           0           0           0
r2051        19.5           0           0           0
r2052       19.51           0           0           0
r2053       19.52           0           0           0
r2054   19.530001           0           0           0
r2055   19.540001           0           0           0
r2056   19.549999           0           0           0
r2057   19.559999           0           0           0
r2058       19.57           0           0           0
r2059       19.58           0           0           0
r2060       19.59           0           0           0
r2061        19.6           0           0           0
r2062   19.610001           0           0           0
r2063   19.620001           0           0           0
r2064   19.629999           0           0           0
r2065   19.639999           0           0           0
r2066       19.65           0           0           0
r2067       19.66           0           0           0
r2068       19.67           0           0           0
r2069       19.68           0           0           0
r2070   19.690001           0           0           0
r2071   19.700001           0           0           0
r2072   19.709999           0           0           0
r2073   19.719999           0           0           0
r2074       19.73           0           0           0
r2075       19.74           0           0           0
r2076       19.75           0           0           0
r2077       19.76           0           0           0
r2078       19.77           0           0           0
r2079   19.780001           0           0           0
r2080   19.790001           0           0           0
r2081   19.799999           0           0           0
r2082   19.809999           0           0           0
r2083       19.82           0           0           0
r2084       19.83           0           0           0
r2085       19.84           0           0           0
r2086       19.85           0           0           0
r2087   19.860001           0           0           0
r2088   19.870001           0           0           0
r2089   19.879999           0           0           0
r2090   19.889999           0           0           0
r2091        19.9           0           0           0
r2092       19.91           0           0           0
r2093       19.92           0           0           0
r2094       19.93           0           0           0
r2095   19.940001           0           0           0
r2096   19.950001           0           0           0
r2097   19.959999           0           0           0
r2098   19.969999           0           0           0
r2099       19.98           0           0           0
r2100       19.99           0           0           0
r; t=0.05 14:56:33

. forvalues i = 1/$n {
  2.         cap drop y_temp 
  3.         qui gen y_temp = y[`i',1]  //take given grid-value and save as constant for all obs.
  4.         ***1999 
.         qui gen phi_hat_`i'_99 = normal( y_temp - xb99 / sigma99) 
  5.         qui sum phi_hat_`i'_99
  6.         mat y[`i',2] = r(mean)
  7.         ***2012
.         qui gen phi_hat_`i'_12 = normal( y_temp - xb12 / sigma12) 
  8.         qui sum phi_hat_`i'_12
  9.         mat y[`i',3] = r(mean)
 10.         ***clean data
.         drop phi_hat_`i'_??
 11. }
r; t=14.44 14:56:48

. 
. save $git/data/overall_analysis.dta, replace
file E:\/data/overall_analysis.dta saved
r; t=1.11 14:56:49

. preserve
r; t=0.00 14:56:49

. clear
r; t=0.03 14:56:49

. svmat y 
number of observations will be reset to 2100
Press any key to continue, or Break to abort
obs was 0, now 2100
r; t=0.00 14:56:49

. save $git/data/uncond_dist.dta , replace 
file E:\/data/uncond_dist.dta saved
r; t=0.06 14:56:49

. graph twoway (scatter y2 y1) (scatter y3 y1), xtitle(ln hourly wage (grid)) name(uncond_dist_simulated, replace) ///
>                                 title(simulated distribution) legend(label(1 "overall 1999") label(2 "overall 2012")) xline(6)
r; t=0.55 14:56:49

. graph export $git\graphs\uncond_dist_simulated_overall.png, replace width(1000) height(750)
(file E:\\graphs\uncond_dist_simulated_overall.png written in PNG format)
r; t=0.25 14:56:50

. graph export $git\graphs\uncond_dist_simulated_overall.pdf, replace 
(file E:\\graphs\uncond_dist_simulated_overall.pdf written in PDF format)
r; t=0.38 14:56:50

. replace y2 = round(y2, .0001)
(1467 real changes made)
r; t=0.00 14:56:50

. replace y3 = round(y3, .001)
(1272 real changes made)
r; t=0.00 14:56:50

. 
. list y3 if y3==float(.1)

      +----+
      | y3 |
      |----|
 543. | .1 |
      +----+
r; t=0.02 14:56:50

. 
. mat d = (0.02, 0, 0) 
r; t=0.00 14:56:50

. forvalues i = .02(0.01)1 {
  2.         mat d = (d \ `i' , 0 , 0)  
  3. }
r; t=0.03 14:56:50

. cap drop ind cutoff
r; t=0.02 14:56:50

. forvalues i = 1/99 {
  2.         *di "quantils for " d[`i',1]
.         forvalues k = 2/3 { 
  3.                 *di "y`k' :" 
.                 qui gen ind = y`k' > d[`i',1]
  4.                 qui bysort ind: gen cutoff = 1 if _n==1
  5.                 qui sum y1 if cutoff==1 & ind==1
  6.                 mat d[`i',`k'] = r(mean)
  7.                 drop ind cutoff
  8.         }
  9. }
r; t=0.13 14:56:50

. svmat d 
r; t=0.00 14:56:50

. graph twoway (scatter d2 d1) (scatter d3 d1), ///
>         xtitle(Quantiles) ytitle(ln hourly wage (in )) name(uncond_dist_simulated, replace) ///
>         title(simulated distribution) legend(label(1 "overall 1999") label(2 "overall 2012")) xline(6)
r; t=0.44 14:56:51

. graph export $git\graphs\uncond_dist_simulated_overall_2.png, replace width(1000) height(750)
(file E:\\graphs\uncond_dist_simulated_overall_2.png written in PNG format)
r; t=0.13 14:56:51

. graph export $git\graphs\uncond_dist_simulated_overall_2.pdf, replace 
(file E:\\graphs\uncond_dist_simulated_overall_2.pdf written in PDF format)
r; t=0.08 14:56:51

. count if y3==float(0.1)
    1
r; t=0.00 14:56:51

. save $git/data/uncond_dist.dta , replace 
file E:\/data/uncond_dist.dta saved
r; t=0.06 14:56:51

. restore
r; t=0.00 14:56:51

. sum lhw // how to choose the vertical line: max value.

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
         lhw |     16091    2.708702     .481612  -.9300292   5.908733
r; t=0.00 14:56:51

. *************************************************************************
. kdensity lhw2006  , name(income_pdf_2006, replace)
r; t=0.41 14:56:51

. kdensity lhw2012  , name(income_pdf_2012, replace)
r; t=0.41 14:56:52

. graph combine income_pdf_2006 income_pdf_2012
r; t=1.89 14:56:54

. graph twoway (kdensity lhw2006) (kdensity lhw2012) ///
>                          (kdensity lhw if bibb2012==0 )            ///
>                          (kdensity lhw if bibb2012==1)             ///
>                          (kdensity lhw if bibb2012==0 & wagemiss==0 )              ///
>                          (kdensity lhw if bibb2012==1 & wagemiss==0)   , xtitle(ln hourly wage)  ///
>                          name(income_pdfs, replace) title(predictions vs. acutal distribution)   ///
>                          legend(label(1 "cond. pred. lhw 2006") label(2 "cond. pred. lhw 2012")  ///
>                                         label(3 "uncond. lhw 2006") label(4 "uncond. lhw 2012" )                 ///
>                                         label(5 "only obs. uncond. lhw 2006") label(6 "only obs. uncond. lhw 2012" ))
r; t=1.45 14:56:55

. graph export $git\graphs\income_pdfs.png , replace  width(1000) height(750) 
(file E:\\graphs\income_pdfs.png written in PNG format)
r; t=0.14 14:56:55

. graph export $git\graphs\income_pdfs.pdf , replace 
(file E:\\graphs\income_pdfs.pdf written in PDF format)
r; t=0.09 14:56:55

. *gen hw2006 = exp(lhw2006)
. *gen hw2012 = exp(lhw2012)
. *graph twoway (kdensity hw2006) (kdensity hw2012) , xtitle(hourly wage)
. log close 
      name:  <unnamed>
       log:  E:\\logs\3_2_regression_decomposititon.log
  log type:  text
 closed on:  20 Feb 2017, 14:56:55
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
