-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\/logs/BIBB1999.log
  log type:  text
 opened on:  20 Feb 2017, 14:55:46
r; t=0.06 14:55:46

. use $git\data\CF_BIBBIAB_Erhebungen\ETB1999_CampusFile , clear
r; t=1.05 14:55:47

. numlabel _all, add
r; t=3.34 14:55:50

. rename *, lower
  (all newnames==oldnames)
r; t=0.00 14:55:50

. *************************************************************************
. *missing codes?
. *alle mit ".w" etc.
. *mvencode v5 v8 v29 v30 v53 v789_cf v12_ab , mv(.w=9999)
. mvdecode v29 v30, mv(9999)
         v29: 108 missing values generated
         v30: 32 missing values generated
r; t=0.03 14:55:50

. *************************************************************************
. **************************************************************************
. des v5 v8 v29 v30 v53 v789_cf v12_ab 

              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
v5              byte    %11.0g     V5         Geschlecht
v8              byte    %8.0g                 Alter in Jahren
v29             float   %28.0g     V29        Wöchentl.Arbeitszeit in der Haupttätigkeit
v30             float   %27.0g     V30        wöchentliche Arbeitszeit in der Nebentätigkeit (bereinigt)
v53             byte    %14.0g     V53        Arbeiten mit Datenverarb
v789_cf         float   %9.0g                 Gewichtungsungsfaktor Campus-File 1999
v12_ab          byte    %50.0g     lberufsabschnitte92
                                              Erwerbsberuf: Berufsabschnitte 1992
r; t=0.00 14:55:50

. sum  v5 v8 v29 v30 v53 v789_cf v12_ab , det

                         Geschlecht
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               22896
25%            1              1       Sum of Wgt.       22896

50%            1                      Mean           1.434093
                        Largest       Std. Dev.      .4956481
75%            2              2
90%            2              2       Variance        .245667
95%            2              2       Skewness       .2659473
99%            2              2       Kurtosis       1.070728

                       Alter in Jahren
-------------------------------------------------------------
      Percentiles      Smallest
 1%           20             16
 5%           24             16
10%           27             16       Obs               22846
25%           32             16       Sum of Wgt.       22846

50%           40                      Mean            40.5611
                        Largest       Std. Dev.      10.95521
75%           49             81
90%           56             84       Variance       120.0167
95%           59             85       Skewness       .2249484
99%           64             85       Kurtosis       2.363582

         Wöchentl.Arbeitszeit in der Haupttätigkeit
-------------------------------------------------------------
      Percentiles      Smallest
 1%           10              4
 5%           15              4
10%           20            4.5       Obs               22788
25%           35              6       Sum of Wgt.       22788

50%           39                      Mean            37.8855
                        Largest       Std. Dev.      12.05841
75%           40            152
90%           50            160       Variance       145.4052
95%           60            168       Skewness       .4711637
99%           70            168       Kurtosis       8.118388

       wöchentliche Arbeitszeit in der Nebentätigkeit
                         (bereinigt)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1             .5
 5%            2             .5
10%          2.5             .5       Obs                 871
25%            5             .5       Sum of Wgt.         871

50%            8                      Mean            10.1023
                        Largest       Std. Dev.      8.048444
75%           12             48
90%           20           48.5       Variance       64.77744
95%           25             50       Skewness       1.900372
99%           40             56       Kurtosis       7.777586

                  Arbeiten mit Datenverarb
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            1              1
10%            1              1       Obs               22886
25%            1              1       Sum of Wgt.       22886

50%            1                      Mean            1.46771
                        Largest       Std. Dev.      .4989671
75%            2              2
90%            2              2       Variance       .2489682
95%            2              2       Skewness       .1294321
99%            2              2       Kurtosis       1.016753

           Gewichtungsungsfaktor Campus-File 1999
-------------------------------------------------------------
      Percentiles      Smallest
 1%     .7696621       .5068601
 5%     .8803758       .5138602
10%     .9538058       .5138602       Obs               22805
25%     1.097202       .5250428       Sum of Wgt.       22805

50%     1.343806                      Mean           1.499208
                        Largest       Std. Dev.      .5887858
75%     1.731806       6.215806
90%     2.232584       6.222584       Variance       .3466687
95%     2.627206       6.292806       Skewness       1.939436
99%     3.670806       6.328376       Kurtosis       9.077491

             Erwerbsberuf: Berufsabschnitte 1992
-------------------------------------------------------------
      Percentiles      Smallest
 1%            1              1
 5%            9              1
10%            9              1       Obs               22896
25%           21              1       Sum of Wgt.       22896

50%           26                      Mean           23.22074
                        Largest       Std. Dev.       7.80923
75%           28             33
90%           31             33       Variance       60.98407
95%           32             33       Skewness      -1.129058
99%           33             33       Kurtosis       3.343244
r; t=0.09 14:55:50

. rename v5               s1              // Geschlecht
r; t=0.00 14:55:50

. rename v8               zpalter         // Alter
r; t=0.00 14:55:50

. rename v29              az              // wöchentliche Arbeitszeit in Haupttätigkeit
r; t=0.00 14:55:50

. *Wie viele Stunden beträgt derzeit im Durchschnitt ihre wöchentliche Arbeitszeit in Ihrer Haupttätigkeit
. *als ... (Regelmäßige Überstunden bitte mitrechen, auf halbe Stunde genau).
. *=> nur vertraglich festgelegte Arbeitszeit ist nicht zu finden
. rename v30              az_nb                   // wöchentliche Arbeitszeit in Nebentätigkeit
r; t=0.00 14:55:50

. rename v789_cf  gew             // Gewicht Campus-File
r; t=0.00 14:55:50

. rename v12_ab   f100stba_ab     // Beruf KldB 1992
r; t=0.00 14:55:50

. *************************************************************************
. *****************************************************************************************************
. *sample-selection to avoid selection bias due to employment status (selection into ~)
. *25-55 years old male fulltime workers
. *weniger Fälle mit f200 oder mehr Fälle mit az
. global arbeitszeitdef az // f200 oder az
r; t=0.00 14:55:50

. gen insample = 1 if $arbeitszeitdef >= 30 & inrange(zpalter, 25, 55) & s1==1 & $arbeitszeitdef!=.  // vollzeit beschäftigte 25-55 Jahre alte Männer
(12813 missing values generated)
r; t=0.02 14:55:50

. tab s1 insample , m

            |       insample
 Geschlecht |         1          . |     Total
------------+----------------------+----------
1. Männlich |    10,083      2,874 |    12,957 
2. Weiblich |         0      9,939 |     9,939 
------------+----------------------+----------
      Total |    10,083     12,813 |    22,896 

r; t=0.00 14:55:50

. sum $arbeitszeitdef zpalter if insample==1, det

         Wöchentl.Arbeitszeit in der Haupttätigkeit
-------------------------------------------------------------
      Percentiles      Smallest
 1%           32             30
 5%           35             30
10%         37.5             30       Obs               10083
25%         38.5             30       Sum of Wgt.       10083

50%           40                      Mean           43.20385
                        Largest       Std. Dev.      8.661415
75%           45            110
90%           55            112       Variance       75.02011
95%           60            120       Skewness       2.493449
99%           75            124       Kurtosis       12.25704

                       Alter in Jahren
-------------------------------------------------------------
      Percentiles      Smallest
 1%           25             25
 5%           27             25
10%           29             25       Obs               10083
25%           33             25       Sum of Wgt.       10083

50%           39                      Mean           39.57126
                        Largest       Std. Dev.      8.137613
75%           46             55
90%           51             55       Variance       66.22074
95%           53             55       Skewness       .1145328
99%           55             55       Kurtosis        1.98686
r; t=0.03 14:55:50

. ********************************************************************************************************************************************************************************
. *** Verdienste nur intervall-vercodet:
. rename v147 f519  // monatl. Bruttoverdienst in DT. intervall-vercodet
r; t=0.00 14:55:50

. tab f519

         monatl. Bruttoverdienst |      Freq.     Percent        Cum.
---------------------------------+-----------------------------------
   1. B       bis unter   600 DM |        341        1.96        1.96
   2. T   600 bis unter 1.000 DM |        698        4.02        5.98
   3. P 1.000 bis unter 1.500 DM |        625        3.60        9.57
   4. F 1.500 bis unter 2.000 DM |      1,264        7.27       16.84
   5. E 2.000 bis unter 2.500 DM |      1,780       10.24       27.08
   6. H 2.500 bis unter 3.000 DM |      2,046       11.77       38.85
   7. I 3.000 bis unter 3.500 DM |      2,145       12.34       51.19
   8. X 3.500 bis unter 4.000 DM |      1,906       10.96       62.16
   9. R 4.000 bis unter 4.500 DM |      1,591        9.15       71.31
  10. M 4.500 bis unter 5.000 DM |      1,328        7.64       78.95
  11. S 5.000 bis unter 5.500 DM |        907        5.22       84.17
  12. K 5.500 bis unter 6.000 DM |        755        4.34       88.51
  13. O 6.000 bis unter 7.000 DM |        830        4.77       93.29
  14. C 7.000 bis unter 8.000 DM |        472        2.72       96.00
  15. G 8.000 bis unter 9.000 DM |        285        1.64       97.64
 16. U 9.000 bis unter 10.000 DM |        128        0.74       98.38
17. A 10.000 bis unter 15.000 DM |        217        1.25       99.63
        18. N 15.000 DM und mehr |         65        0.37      100.00
---------------------------------+-----------------------------------
                           Total |     17,383      100.00
r; t=0.02 14:55:50

. /* prepare dependent variable for intervall regression:
>     - intreg fits a model of y=[depvar1, depvar2] on indepvars, where y for each observation is point
>     data, interval data, left-censored data, or right-censored data.
> 
>     depvar1 and depvar2 should have the following form:
> 
>              Type of data                  depvar1  depvar2
>              ----------------------------------------------
>              point data          a = [a,a]    a        a 
>              interval data           [a,b]    a        b
>              left-censored data   (-inf,b]    .        b
>              right-censored data   [a,inf)    a        . 
>              ----------------------------------------------
> 
>          monatl. Bruttoverdienst |      Freq.     Percent        Cum.
> ---------------------------------+-----------------------------------
>    1. B       bis unter   600 DM |        341        1.96        1.96
>    2. T   600 bis unter 1.000 DM |        698        4.02        5.98
>    3. P 1.000 bis unter 1.500 DM |        625        3.60        9.57
>    4. F 1.500 bis unter 2.000 DM |      1,264        7.27       16.84
>    5. E 2.000 bis unter 2.500 DM |      1,780       10.24       27.08
>    6. H 2.500 bis unter 3.000 DM |      2,046       11.77       38.85
>    7. I 3.000 bis unter 3.500 DM |      2,145       12.34       51.19
>    8. X 3.500 bis unter 4.000 DM |      1,906       10.96       62.16
>    9. R 4.000 bis unter 4.500 DM |      1,591        9.15       71.31
>   10. M 4.500 bis unter 5.000 DM |      1,328        7.64       78.95
>   11. S 5.000 bis unter 5.500 DM |        907        5.22       84.17
>   12. K 5.500 bis unter 6.000 DM |        755        4.34       88.51
>   13. O 6.000 bis unter 7.000 DM |        830        4.77       93.29
>   14. C 7.000 bis unter 8.000 DM |        472        2.72       96.00
>   15. G 8.000 bis unter 9.000 DM |        285        1.64       97.64
>  16. U 9.000 bis unter 10.000 DM |        128        0.74       98.38
> 17. A 10.000 bis unter 15.000 DM |        217        1.25       99.63
>         18. N 15.000 DM und mehr |         65        0.37      100.00
> ---------------------------------+-----------------------------------
> *!!! DM !!!
> * 1.95583 DM = 1 Euro 
> * what about inflation? 
> */
. * right censoring to infity:
. 
. recode f519 ///
>   1 = 600    2 = 1000   3 = 1500   4 = 2000      5 = 2500   6 = 3000 ///
>   7 = 3500   8 = 4000   9 = 4500  10 = 5000 11 = 5500 12 = 6000  ///
>  13 = 7000 14 = 8000 15 = 9000 16 = 10000 17 = 15000 18 =  . , gen(w_upper)
(17383 differences between f519 and w_upper)
r; t=0.20 14:55:51

.  
. *no left-censoring: set left boundary to 0:
. recode f519   1 = 0   2 = 600   3 = 1000  4 = 1500  5 = 2000  6 = 2500  7 = 3000  8 = 3500  ///
>   9 = 4000  10 = 4500 11 = 5000 12 = 5500 13 = 6000 14 = 7000 15 = 8000 16 = 9000 17 = 10000 ///
>  18 = 15000,  gen(w_lower)
(17383 differences between f519 and w_lower)
r; t=0.20 14:55:51

. tab w_* ,m 

 RECODE of |
      f519 |
  (monatl. |
Bruttoverd |                                                               RECODE of f519 (monatl. Bruttoverdienst)
    ienst) |         0        600       1000       1500       2000       2500       3000       3500       4000       4500       5000       5500       6000       7000       8000 |     Total
-----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
       600 |       341          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |       341 
      1000 |         0        698          0          0          0          0          0          0          0          0          0          0          0          0          0 |       698 
      1500 |         0          0        625          0          0          0          0          0          0          0          0          0          0          0          0 |       625 
      2000 |         0          0          0      1,264          0          0          0          0          0          0          0          0          0          0          0 |     1,264 
      2500 |         0          0          0          0      1,780          0          0          0          0          0          0          0          0          0          0 |     1,780 
      3000 |         0          0          0          0          0      2,046          0          0          0          0          0          0          0          0          0 |     2,046 
      3500 |         0          0          0          0          0          0      2,145          0          0          0          0          0          0          0          0 |     2,145 
      4000 |         0          0          0          0          0          0          0      1,906          0          0          0          0          0          0          0 |     1,906 
      4500 |         0          0          0          0          0          0          0          0      1,591          0          0          0          0          0          0 |     1,591 
      5000 |         0          0          0          0          0          0          0          0          0      1,328          0          0          0          0          0 |     1,328 
      5500 |         0          0          0          0          0          0          0          0          0          0        907          0          0          0          0 |       907 
      6000 |         0          0          0          0          0          0          0          0          0          0          0        755          0          0          0 |       755 
      7000 |         0          0          0          0          0          0          0          0          0          0          0          0        830          0          0 |       830 
      8000 |         0          0          0          0          0          0          0          0          0          0          0          0          0        472          0 |       472 
      9000 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0        285 |       285 
     10000 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |       128 
     15000 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |       217 
         . |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |        65 
        .a |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |     2,938 
        .t |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |     2,575 
-----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |       341        698        625      1,264      1,780      2,046      2,145      1,906      1,591      1,328        907        755        830        472        285 |    22,896 


 RECODE of |
      f519 |
  (monatl. |
Bruttoverd |        RECODE of f519 (monatl. Bruttoverdienst)
    ienst) |      9000      10000      15000         .a         .t |     Total
-----------+-------------------------------------------------------+----------
       600 |         0          0          0          0          0 |       341 
      1000 |         0          0          0          0          0 |       698 
      1500 |         0          0          0          0          0 |       625 
      2000 |         0          0          0          0          0 |     1,264 
      2500 |         0          0          0          0          0 |     1,780 
      3000 |         0          0          0          0          0 |     2,046 
      3500 |         0          0          0          0          0 |     2,145 
      4000 |         0          0          0          0          0 |     1,906 
      4500 |         0          0          0          0          0 |     1,591 
      5000 |         0          0          0          0          0 |     1,328 
      5500 |         0          0          0          0          0 |       907 
      6000 |         0          0          0          0          0 |       755 
      7000 |         0          0          0          0          0 |       830 
      8000 |         0          0          0          0          0 |       472 
      9000 |         0          0          0          0          0 |       285 
     10000 |       128          0          0          0          0 |       128 
     15000 |         0        217          0          0          0 |       217 
         . |         0          0         65          0          0 |        65 
        .a |         0          0          0      2,938          0 |     2,938 
        .t |         0          0          0          0      2,575 |     2,575 
-----------+-------------------------------------------------------+----------
     Total |       128        217         65      2,938      2,575 |    22,896 

r; t=0.02 14:55:51

. ***
. replace w_upper = w_upper / 1.95583 // Euro-DM conversion (without inflation correction)
(22831 real changes made, 5513 to missing)
r; t=0.00 14:55:51

. replace w_lower = w_lower / 1.95583 // Euro-DM conversion (without inflation correction)
(22555 real changes made, 5513 to missing)
r; t=0.00 14:55:51

. tab w_* , m

 RECODE of |
      f519 |
  (monatl. |
Bruttoverd |                                                               RECODE of f519 (monatl. Bruttoverdienst)
    ienst) |         0   306.7751   511.2919   766.9378   1022.584    1278.23   1533.876   1789.522   2045.167   2300.813   2556.459   2812.105   3067.751   3579.043   4090.335 |     Total
-----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
  306.7751 |       341          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |       341 
  511.2919 |         0        698          0          0          0          0          0          0          0          0          0          0          0          0          0 |       698 
  766.9378 |         0          0        625          0          0          0          0          0          0          0          0          0          0          0          0 |       625 
  1022.584 |         0          0          0      1,264          0          0          0          0          0          0          0          0          0          0          0 |     1,264 
   1278.23 |         0          0          0          0      1,780          0          0          0          0          0          0          0          0          0          0 |     1,780 
  1533.876 |         0          0          0          0          0      2,046          0          0          0          0          0          0          0          0          0 |     2,046 
  1789.522 |         0          0          0          0          0          0      2,145          0          0          0          0          0          0          0          0 |     2,145 
  2045.167 |         0          0          0          0          0          0          0      1,906          0          0          0          0          0          0          0 |     1,906 
  2300.813 |         0          0          0          0          0          0          0          0      1,591          0          0          0          0          0          0 |     1,591 
  2556.459 |         0          0          0          0          0          0          0          0          0      1,328          0          0          0          0          0 |     1,328 
  2812.105 |         0          0          0          0          0          0          0          0          0          0        907          0          0          0          0 |       907 
  3067.751 |         0          0          0          0          0          0          0          0          0          0          0        755          0          0          0 |       755 
  3579.043 |         0          0          0          0          0          0          0          0          0          0          0          0        830          0          0 |       830 
  4090.335 |         0          0          0          0          0          0          0          0          0          0          0          0          0        472          0 |       472 
  4601.627 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0        285 |       285 
  5112.919 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |       128 
  7669.378 |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |       217 
         . |         0          0          0          0          0          0          0          0          0          0          0          0          0          0          0 |     5,578 
-----------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------+----------
     Total |       341        698        625      1,264      1,780      2,046      2,145      1,906      1,591      1,328        907        755        830        472        285 |    22,896 


 RECODE of |
      f519 |
  (monatl. |
Bruttoverd |  RECODE of f519 (monatl. Bruttoverdienst)
    ienst) |  4601.627   5112.919   7669.378          . |     Total
-----------+--------------------------------------------+----------
  306.7751 |         0          0          0          0 |       341 
  511.2919 |         0          0          0          0 |       698 
  766.9378 |         0          0          0          0 |       625 
  1022.584 |         0          0          0          0 |     1,264 
   1278.23 |         0          0          0          0 |     1,780 
  1533.876 |         0          0          0          0 |     2,046 
  1789.522 |         0          0          0          0 |     2,145 
  2045.167 |         0          0          0          0 |     1,906 
  2300.813 |         0          0          0          0 |     1,591 
  2556.459 |         0          0          0          0 |     1,328 
  2812.105 |         0          0          0          0 |       907 
  3067.751 |         0          0          0          0 |       755 
  3579.043 |         0          0          0          0 |       830 
  4090.335 |         0          0          0          0 |       472 
  4601.627 |         0          0          0          0 |       285 
  5112.919 |       128          0          0          0 |       128 
  7669.378 |         0        217          0          0 |       217 
         . |         0          0         65      5,513 |     5,578 
-----------+--------------------------------------------+----------
     Total |       128        217         65      5,513 |    22,896 

r; t=0.02 14:55:51

. ***NOTE:
. *performing the log-transformation on interval wages leads the 0 boundry to become "sysmis" (as required
. * for the interval-regression-command. In order to avoid artefacts I only keep non-missing observations:
. * see wagemiss below:
. keep  if inrange(f519,1,18)
(5513 observations deleted)
r; t=0.02 14:55:51

. *******************/
. gen azm  = $arbeitszeitdef *4.345               // (365/12)/7: tarifliche Normalzeit in Wochen pro Monat, d.h. ein Monat umfasst durchschnittlich 4,345 Wochen
(27 missing values generated)
r; t=0.00 14:55:51

. cap drop wage
r; t=0.00 14:55:51

. gen wage        = w_lower + (w_upper - w_lower )  
(65 missing values generated)
r; t=0.00 14:55:51

. tab wage         // intervall midpoints as imputed values for real wages. 

       wage |      Freq.     Percent        Cum.
------------+-----------------------------------
   306.7751 |        341        1.97        1.97
   511.2919 |        698        4.03        6.00
   766.9378 |        625        3.61        9.61
   1022.584 |      1,264        7.30       16.91
    1278.23 |      1,780       10.28       27.19
   1533.876 |      2,046       11.81       39.00
   1789.522 |      2,145       12.39       51.39
   2045.167 |      1,906       11.01       62.39
   2300.813 |      1,591        9.19       71.58
   2556.459 |      1,328        7.67       79.25
   2812.105 |        907        5.24       84.48
   3067.751 |        755        4.36       88.84
   3579.043 |        830        4.79       93.64
   4090.335 |        472        2.73       96.36
   4601.627 |        285        1.65       98.01
   5112.919 |        128        0.74       98.75
   7669.378 |        217        1.25      100.00
------------+-----------------------------------
      Total |     17,318      100.00
r; t=0.00 14:55:51

. gen hwage  = wage / azm
(92 missing values generated)
r; t=0.00 14:55:51

. gen lhw = ln(hwage)  // log and ln give same results.
(92 missing values generated)
r; t=0.02 14:55:51

. list hwage az if hwage < 2  // discard people with monethly wage of 1 ?

       +-----------------+
       |    hwage     az |
       |-----------------|
  300. |  1.47092     48 |
  365. | 1.765104     40 |
  593. | 1.765104     40 |
  897. | .9169372     77 |
  903. | 1.008631     70 |
       |-----------------|
  944. | 1.502216     47 |
 3507. | 1.961227     36 |
 3711. | 1.681052     42 |
 3754. | 1.765104     40 |
 4447. | 1.765104     40 |
       |-----------------|
 5738. | 1.765104     40 |
 6139. | 1.858004     38 |
 6571. | 1.882778   37.5 |
 7187. | 1.344841   52.5 |
 7772. | 1.765104     40 |
       |-----------------|
 8046. | 1.765104     40 |
 8152. | 1.765104     40 |
 8390. | 1.908221     37 |
 8737. | 1.086218     65 |
 9225. | 1.765104     40 |
       |-----------------|
 9404. | 1.412083     50 |
 9798. | 1.412083     50 |
10713. | 1.765104     40 |
11142. | 1.765104     40 |
13071. | 1.810363     39 |
       |-----------------|
13126. | 1.858004     38 |
13595. | 1.833874   38.5 |
13713. | 1.412083     50 |
14163. | 1.858004     38 |
14974. | 1.961227     36 |
       |-----------------|
15345. | 1.961227     60 |
16240. | 1.810363     39 |
       +-----------------+
r; t=0.00 14:55:51

. sum hwage, det    // trim data of wage at both ends by one percent? not done

                            hwage
-------------------------------------------------------------
      Percentiles      Smallest
 1%     3.922454       .9169372
 5%     5.883681       1.008631
10%     7.060417       1.086218       Obs               17291
25%     8.825521       1.344841       Sum of Wgt.       17291

50%     11.76736                      Mean           13.05228
                        Largest       Std. Dev.      8.103938
75%     15.28229       176.5104
90%     20.17262       176.5104       Variance       65.67381
95%     23.53472       176.5104       Skewness       9.026206
99%     35.30209       176.5104       Kurtosis       155.4073
r; t=0.02 14:55:51

. gen hw_upper=w_upper/(azm)   // hourly wages for each person, upper 
(92 missing values generated)
r; t=0.00 14:55:51

. gen hw_lower=w_lower/(azm)   // ... , lower
(27 missing values generated)
r; t=0.00 14:55:51

. *some research on wages:
. gen lhw_upper = ln(hw_upper)  
(92 missing values generated)
r; t=0.02 14:55:51

. gen lhw_lower = ln(hw_lower)
(367 missing values generated)
r; t=0.00 14:55:51

. ** all wages are interval-coded, but for appending data-sets:
. gen wagemiss = 1 if inrange(f519,1,18)
r; t=0.00 14:55:51

. tab  f519 wagemiss, m

              monatl. |  wagemiss
      Bruttoverdienst |         1 |     Total
----------------------+-----------+----------
1. B       bis unter  |       341 |       341 
2. T   600 bis unter  |       698 |       698 
3. P 1.000 bis unter  |       625 |       625 
4. F 1.500 bis unter  |     1,264 |     1,264 
5. E 2.000 bis unter  |     1,780 |     1,780 
6. H 2.500 bis unter  |     2,046 |     2,046 
7. I 3.000 bis unter  |     2,145 |     2,145 
8. X 3.500 bis unter  |     1,906 |     1,906 
9. R 4.000 bis unter  |     1,591 |     1,591 
10. M 4.500 bis unter |     1,328 |     1,328 
11. S 5.000 bis unter |       907 |       907 
12. K 5.500 bis unter |       755 |       755 
13. O 6.000 bis unter |       830 |       830 
14. C 7.000 bis unter |       472 |       472 
15. G 8.000 bis unter |       285 |       285 
16. U 9.000 bis unter |       128 |       128 
17. A 10.000 bis unte |       217 |       217 
18. N 15.000 DM und m |        65 |        65 
----------------------+-----------+----------
                Total |    17,383 |    17,383 

r; t=0.00 14:55:51

. **************************************************************************
. *Table 2: Occupational Categories:
. des f100stba_ab

              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
f100stba_ab     byte    %50.0g     lberufsabschnitte92
                                              Erwerbsberuf: Berufsabschnitte 1992
r; t=0.00 14:55:51

. tab f100stba_ab

    Erwerbsberuf: Berufsabschnitte 1992 |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
    1. Land-/Forstwirtschaft, Gartenbau |        296        1.70        1.70
                           2. Bergleute |         27        0.16        1.86
3. Steinbearbeitung und Baustoffherstel |         16        0.09        1.95
                 4. Keramik-/Glasberufe |         29        0.17        2.12
            5. Chemie-/Kunststoffberufe |        119        0.68        2.80
            6. Papierherstellung, Druck |        116        0.67        3.47
                     7. Holzbearbeitung |         21        0.12        3.59
    8. Metallerzeugung und -bearbeitung |        220        1.27        4.86
                9. Metall-/Maschinenbau |      1,145        6.59       11.44
                      10. Elektroberufe |        447        2.57       14.01
                          11. Montierer |         83        0.48       14.49
              12. Textil und Bekleidung |         93        0.54       15.03
     13. Lederherstellung/-verarbeitung |          8        0.05       15.07
                          14. Ernährung |        390        2.24       17.32
                      15. Hoch-/Tiefbau |        511        2.94       20.26
            16. Ausbauberufe, Polsterer |        256        1.47       21.73
     17. Holz- und Kunstoffverarbeitung |        170        0.98       22.71
                    18. Maler,Lackierer |        155        0.89       23.60
    19. Warenprüfer, Versandabfertigung |        155        0.89       24.49
20. Hilfsarbeiter in der Fertigung o.n. |        258        1.48       25.97
                       21. Maschinisten |        260        1.50       27.47
22. Ingenieure,Chemiker,Physiker, Mathe |        471        2.71       30.18
                          23. Techniker |        696        4.00       34.18
                     24. Warenkaufleute |      1,529        8.80       42.98
           25. Dienstleistungskaufleute |        661        3.80       46.78
                     26. Verkehrsberufe |      1,066        6.13       52.91
                         27. Büroberufe |      3,669       21.11       74.02
             28. Ordnung und Sicherheit |        598        3.44       77.46
29. Schriftwerkschaffende und künstleri |        206        1.19       78.65
                  30. Gesundheitsberufe |        973        5.60       84.24
       31. Sozial- und Erziehungsberufe |      1,675        9.64       93.88
     32. sonstige Dienstleistungsberufe |        936        5.38       99.26
             33. sonstige Arbeitskräfte |        128        0.74      100.00
----------------------------------------+-----------------------------------
                                  Total |     17,383      100.00
r; t=0.02 14:55:51

. cap drop occupational_categories*
r; t=0.00 14:55:51

. recode f100stba_ab (2 3 4 =2) (5 = 3) (6 7 = 4) (8=5) (9=6) (10 11 = 7) (12 13 = 8) (14=9) (15=10) (16=11) (17=12) (18/20 =13) (22= 14) (21 23 = 15) (24= 16) (25=17) (26=18) (27=19) (28/33 
> = 20) , gen(occupational_categories)
(17060 differences between f100stba_ab and occupational_categories)
r; t=0.25 14:55:51

. tab occupational_categories, gen(occupational_categories_)

  RECODE of |
f100stba_ab |
(Erwerbsber |
        uf: |
Berufsabsch |
nitte 1992) |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        296        1.70        1.70
          2 |         72        0.41        2.12
          3 |        119        0.68        2.80
          4 |        137        0.79        3.59
          5 |        220        1.27        4.86
          6 |      1,145        6.59       11.44
          7 |        530        3.05       14.49
          8 |        101        0.58       15.07
          9 |        390        2.24       17.32
         10 |        511        2.94       20.26
         11 |        256        1.47       21.73
         12 |        170        0.98       22.71
         13 |        568        3.27       25.97
         14 |        471        2.71       28.68
         15 |        956        5.50       34.18
         16 |      1,529        8.80       42.98
         17 |        661        3.80       46.78
         18 |      1,066        6.13       52.91
         19 |      3,669       21.11       74.02
         20 |      4,516       25.98      100.00
------------+-----------------------------------
      Total |     17,383      100.00
r; t=0.02 14:55:51

. ***! skilllevel anders zusammengesetzt im Vergleich zum Jahr 2006/12
. tab v405

                Art berufl. Ausbild. 1. |      Freq.     Percent        Cum.
----------------------------------------+-----------------------------------
              1. A  Betriebliche  Lehre |     11,225       64.84       64.84
2. B Schulische Berufsausbildung in Ber |      1,492        8.62       73.46
                           3. C Studium |      2,152       12.43       85.89
      4. D Beamtenausbildung  nicht DDR |        383        2.21       88.10
5. E Referendariat, Facharztausbildung, |         52        0.30       88.40
6. F Ausbildung  Fortbildung  zum Meist |        123        0.71       89.11
                       7. G Volontariat |         28        0.16       89.27
                 8. H Traineeausbildung |         24        0.14       89.41
9. I Sonstige berufliche Fortbildung od |        303        1.75       91.16
10. Habe keine berufliche Ausbildung od |      1,530        8.84      100.00
----------------------------------------+-----------------------------------
                                  Total |     17,312      100.00
r; t=0.00 14:55:51

. des v405

              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
v405            byte    %40.0g     V405       Art berufl. Ausbild. 1.
r; t=0.00 14:55:51

. recode v405  (7 8 9 10 = 1)  (1 2 4 6 =2) (3 5 =3) (.w=.), gen(skilllevel) 
(13739 differences between v405 and skilllevel)
r; t=0.09 14:55:51

. *****************************************************************************
. *****************************************************************************
. des v189  -  v201  // insgesamt können in allen den Datensätzen 99/06/12 12 Variablen genutz werden

              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
v189            byte    %25.0g     V189       häufig: Ausbilden, Lehr.
v190            byte    %25.0g     V190       häufig: andere beraten
v191            byte    %25.0g     V191       häufig: Messen, prüfen
v192            byte    %25.0g     V192       häufig: Überwachen
v193            byte    %25.0g     V193       häufig: Reparieren
v194            byte    %25.0g     V194       häufig: Einkaufen, Verk.
v195            byte    %25.0g     V195       häufig: Organisieren
v196            byte    %25.0g     V196       häufig: Marketing
v197            byte    %25.0g     V197       häufig: Infos auswerten
v198            byte    %25.0g     V198       häufig: Verhandlungen
v199            byte    %25.0g     V199       häufig: Entwickeln
v200            byte    %25.0g     V200       häufig: Herstellen
v201            byte    %25.0g     V201       häufig: Versorgen
r; t=0.00 14:55:51

. *vergleich auf Basis der Liste 201 im Fragebogen 1999 (pdf-seite 104)
. *** non routine analytical:
. rename v199  f311 // Entwickeln, Forschen, Konstruieren
r; t=0.00 14:55:51

. rename v197  f313 // Informationen sammeln, auswerten /recherchieren
r; t=0.00 14:55:51

. *** non routine interactive: 
. rename v194 f307 // Einkaufen, Beschaffen, Verkaufen
r; t=0.00 14:55:51

. rename v196 f309 // Werben, Marketing
r; t=0.00 14:55:51

. rename v195 f310 // Organisieren, Planen und Vorbereiten
r; t=0.00 14:55:51

. rename v189 f312 // Ausbilden, Lehren, Unterrichten
r; t=0.00 14:55:51

. rename v190 f314 // Beraten und Informiern
r; t=0.00 14:55:51

. *** routine cognitive:
. rename v191 f304 // Messen, Prüfen, Qualität kontrollieren
r; t=0.00 14:55:51

. *** routine manual 
. rename v200 f303 // Herstellen, Produzieren von Waren und Gütern
r; t=0.00 14:55:51

. rename v192 f305 // Überwachen, Steuern von Maschinen, Anlagen, technischen Prozessen
r; t=0.00 14:55:51

. *f317 // Sichern, Schützen, Bewachen, Überwachen, Vekehr fehlt. 
. *fehlt  f308 // Transportieren, Lagern, Versenden
. * rename v198 // Verhandlungen
. *** non-routine manuel:
. rename v193 f306 // Reparieren, Instandsetzen
r; t=0.00 14:55:51

. * f315 fehlt // Bewirten, Beherbergen, Speisen bereiten 
. rename v201 f316 // Versorgen, Bedienen, Betreuen von Menschen (2012: Pflegen, Betreuen, Heilen)
r; t=0.00 14:55:51

. **************************************************************************
. **Classification of tasks (14? I found 15!)
. global non_routine                                      f311 f313 
r; t=0.00 14:55:51

. global non_routine_interactive          f307 f309 f310 f312 f314 
r; t=0.00 14:55:51

. global routine_cognitive                        f304    
r; t=0.00 14:55:51

. global routine_manual                           f303 f305 // fehlen 1999: f308 f317 
r; t=0.00 14:55:51

. *! f308 (Transportieren, Lagern, Versenden) wird bei AFL 2009 aber als task angegeben.
. * könnte v72 sein. 
. global non_routine_manual                       f306  f316 // fehlt 1999 f315
r; t=0.00 14:55:51

. des $non_routine

              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
f311            byte    %25.0g     V199       häufig: Entwickeln
f313            byte    %25.0g     V197       häufig: Infos auswerten
r; t=0.00 14:55:51

. des $non_routine_interactive

              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
f307            byte    %25.0g     V194       häufig: Einkaufen, Verk.
f309            byte    %25.0g     V196       häufig: Marketing
f310            byte    %25.0g     V195       häufig: Organisieren
f312            byte    %25.0g     V189       häufig: Ausbilden, Lehr.
f314            byte    %25.0g     V190       häufig: andere beraten
r; t=0.00 14:55:51

. des $routine_cognitive

              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
f304            byte    %25.0g     V191       häufig: Messen, prüfen
r; t=0.00 14:55:51

. des $routine_manual

              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
f303            byte    %25.0g     V200       häufig: Herstellen
f305            byte    %25.0g     V192       häufig: Überwachen
r; t=0.00 14:55:51

. des $non_routine_manual

              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
f306            byte    %25.0g     V193       häufig: Reparieren
f316            byte    %25.0g     V201       häufig: Versorgen
r; t=0.00 14:55:51

. 
. global num : list sizeof global non_routine
r; t=0.00 14:55:51

. di $num
2
r; t=0.00 14:55:51

. local num : word count global non_routine
r; t=0.00 14:55:51

. di `num'
2
r; t=0.00 14:55:51

. 
. egen non_routine                                = anycount($non_routine)                         , values(1)
r; t=0.02 14:55:51

. egen non_routine_interactive    = anycount($non_routine_interactive) , values(1)
r; t=0.03 14:55:51

. egen routine_cognitive                  = anycount($routine_cognitive           ), values(1)
r; t=0.00 14:55:51

. egen routine_manual                             = anycount($routine_manual                      ), values(1)
r; t=0.02 14:55:51

. egen non_routine_manual                 = anycount($non_routine_manual          ), values(1)
r; t=0.02 14:55:51

. global task_vars non_routine  non_routine_interactive  routine_cognitive  routine_manual  non_routine_manual            
r; t=0.00 14:55:51

. egen tasks_total_ind = rowtotal($task_vars)
r; t=0.02 14:55:51

. *recode $task_vars . = 0 // general index.
. 
. *Task-Indecies
. *SO ("objective")   - Spitz-Oener Index
. *intensity per task category (#of task per category by individual) given total number of activities
. *in category j.
. gen index_so_1 = non_routine                            / 2     
r; t=0.02 14:55:51

. gen index_so_2 = non_routine_interactive        / 5
r; t=0.00 14:55:51

. gen index_so_3 = routine_cognitive                      / 1
r; t=0.00 14:55:51

. gen index_so_4 = routine_manual                         / 4     
r; t=0.00 14:55:51

. gen index_so_5 = non_routine_manual                     / 3     
r; t=0.00 14:55:51

. 
. egen cum_so_index = rowtotal(index_so_?)
r; t=0.03 14:55:51

. 
. *AFL ("objective")  - Antonczyk, Fitzenberger, Leuschner- Index 
. *intensity per task category (#of tasks per category) given total tasks of indiviudal
. gen index_afl_1 = non_routine                           / tasks_total_ind               
(2120 missing values generated)
r; t=0.00 14:55:51

. gen index_afl_2 = non_routine_interactive       / tasks_total_ind
(2120 missing values generated)
r; t=0.00 14:55:51

. gen index_afl_3 = routine_cognitive                     / tasks_total_ind
(2120 missing values generated)
r; t=0.00 14:55:51

. gen index_afl_4 = routine_manual                        / tasks_total_ind       
(2120 missing values generated)
r; t=0.00 14:55:51

. gen index_afl_5 = non_routine_manual            / tasks_total_ind       
(2120 missing values generated)
r; t=0.00 14:55:51

. *************************************************************************************
. egen cum_afl_index = rowtotal(index_afl_?)
r; t=0.03 14:55:52

. *NJC ("objective") job complexity - total number of task
. gen njc = tasks_total_ind
r; t=0.00 14:55:52

. 
. *************************************************************************************
. tab1 v265 v266 v267 v268 v271 v272, missing

-> tabulation of v265  

  Durchführung vorgeschr. |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
       1. Praktisch immer |      2,447       14.08       14.08
                2. Häufig |      3,143       18.08       32.16
      3. Immer mal wieder |      2,965       17.06       49.21
                4. Selten |      4,397       25.29       74.51
         5. Praktisch nie |      4,415       25.40       99.91
.w. Weiß nicht verweigert |         16        0.09      100.00
--------------------------+-----------------------------------
                    Total |     17,383      100.00

-> tabulation of v266  

  Arbeitsvorg. wiederholt |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
       1. Praktisch immer |      2,823       16.24       16.24
                2. Häufig |      4,998       28.75       44.99
      3. Immer mal wieder |      3,886       22.36       67.35
                4. Selten |      2,965       17.06       84.40
         5. Praktisch nie |      2,704       15.56       99.96
.w. Weiß nicht verweigert |          7        0.04      100.00
--------------------------+-----------------------------------
                    Total |     17,383      100.00

-> tabulation of v267  

 in Aufgaben hineindenken |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
       1. Praktisch immer |      1,262        7.26        7.26
                2. Häufig |      4,696       27.01       34.27
      3. Immer mal wieder |      5,518       31.74       66.02
                4. Selten |      3,500       20.13       86.15
         5. Praktisch nie |      2,398       13.80       99.95
.w. Weiß nicht verweigert |          9        0.05      100.00
--------------------------+-----------------------------------
                    Total |     17,383      100.00

-> tabulation of v268  

     Verfahren verbessern |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
       1. Praktisch immer |        714        4.11        4.11
                2. Häufig |      3,068       17.65       21.76
      3. Immer mal wieder |      5,290       30.43       52.19
                4. Selten |      4,069       23.41       75.60
         5. Praktisch nie |      4,202       24.17       99.77
.w. Weiß nicht verweigert |         40        0.23      100.00
--------------------------+-----------------------------------
                    Total |     17,383      100.00

-> tabulation of v271  

      Dinge nicht gelernt |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
       1. Praktisch immer |        208        1.20        1.20
                2. Häufig |        923        5.31        6.51
      3. Immer mal wieder |      3,024       17.40       23.90
                4. Selten |      5,125       29.48       53.39
         5. Praktisch nie |      8,064       46.39       99.78
.w. Weiß nicht verweigert |         39        0.22      100.00
--------------------------+-----------------------------------
                    Total |     17,383      100.00

-> tabulation of v272  

  verschied. gleichzeitig |      Freq.     Percent        Cum.
--------------------------+-----------------------------------
       1. Praktisch immer |      2,862       16.46       16.46
                2. Häufig |      4,715       27.12       43.59
      3. Immer mal wieder |      3,707       21.33       64.91
                4. Selten |      2,565       14.76       79.67
         5. Praktisch nie |      3,510       20.19       99.86
.w. Weiß nicht verweigert |         24        0.14      100.00
--------------------------+-----------------------------------
                    Total |     17,383      100.00
r; t=0.03 14:55:52

. des  v265 v266 v267 v268 v271 v272 , varlist

              storage   display    value
variable name   type    format     label      variable label
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
v265            byte    %25.0g     V265       Durchführung vorgeschr.
v266            byte    %25.0g     V266       Arbeitsvorg. wiederholt
v267            byte    %25.0g     V267       in Aufgaben hineindenken
v268            byte    %25.0g     V268       Verfahren verbessern
v271            byte    %25.0g     V271       Dinge nicht gelernt
v272            byte    %25.0g     V272       verschied. gleichzeitig
r; t=0.00 14:55:52

. local i = 1 
r; t=0.00 14:55:52

. cap drop jr_?
r; t=0.00 14:55:52

. foreach var in `r(varlist)' {
  2.         di "job requirement `i' corresponds to `var'"
  3.         recode `var' 1 2 = 1 3 4 5 = 0 .w =.  , gen(jr_`i')
  4.         local i = `i' + 1
  5. }
job requirement 1 corresponds to v265
(14936 differences between v265 and jr_1)
job requirement 2 corresponds to v266
(14560 differences between v266 and jr_2)
job requirement 3 corresponds to v267
(16121 differences between v267 and jr_3)
job requirement 4 corresponds to v268
(16669 differences between v268 and jr_4)
job requirement 5 corresponds to v271
(17175 differences between v271 and jr_5)
job requirement 6 corresponds to v272
(14521 differences between v272 and jr_6)
r; t=0.39 14:55:52

. cap drop sjc
r; t=0.00 14:55:52

. gen sjc = (-1) * jr_1 + (-1) *jr_2 + jr_3 + jr_4 + jr_5 + jr_6
(110 missing values generated)
r; t=0.02 14:55:52

. list sjc jr_? in 1/10

     +-----------------------------------------------+
     | sjc   jr_1   jr_2   jr_3   jr_4   jr_5   jr_6 |
     |-----------------------------------------------|
  1. |  -1      1      1      0      0      0      1 |
  2. |   1      0      0      0      0      0      1 |
  3. |   .      0      0      0      1      .      . |
  4. |   1      0      0      0      1      0      0 |
  5. |   1      1      0      1      0      0      1 |
     |-----------------------------------------------|
  6. |  -2      1      1      0      0      0      0 |
  7. |  -1      1      1      0      1      0      0 |
  8. |  -1      1      1      0      0      0      1 |
  9. |   1      1      1      1      1      1      0 |
 10. |   2      0      1      1      1      0      1 |
     +-----------------------------------------------+
r; t=0.00 14:55:52

. *************************************************************************************
. ** does pcuse exit?
. tab v53  // Arbeiten sie des öfteren bei ihrer beruflichen (Haupt-) Tätigkeit mit Computern und 

  Arbeiten mit |
   Datenverarb |      Freq.     Percent        Cum.
---------------+-----------------------------------
         1. Ja |      9,018       51.91       51.91
       2. Nein |      8,356       48.09      100.00
---------------+-----------------------------------
         Total |     17,374      100.00
r; t=0.00 14:55:52

.                  // Datenverarbeitungsgeräten?
. tab v54  // Personal/- Bürocomputer 

     Personal -Bürocomputer |      Freq.     Percent        Cum.
----------------------------+-----------------------------------
           0. Nicht genannt |      3,065       34.07       34.07
                 1. Genannt |      5,930       65.93      100.00
----------------------------+-----------------------------------
                      Total |      8,995      100.00
r; t=0.00 14:55:52

. recode v53 2=0 , gen(pcuse)  // Angabe basiert nicht auf Häufigkeitsskala, sondern auf Frage nach
(8356 differences between v53 and pcuse)
r; t=0.03 14:55:52

.                                                          // "öfterer" beruflichen Tätigkeit.
.                                                          
. *keep if lhw != .
. gen cond = 1 if lhw!=. & insample==1                             
(9704 missing values generated)
r; t=0.00 14:55:52

. *****************************************************************************************
. global all hwage lhw* wagemiss skilllevel zpalter occupational_categories index_afl_? njc sjc pcuse cond gew  index_so_? $task_vars
r; t=0.00 14:55:52

. order $all 
r; t=0.15 14:55:52

. keep  $all 
r; t=0.00 14:55:52

. save  $git\data\bibb1999_constructs.dta  , replace 
file E:\\data\bibb1999_constructs.dta saved
r; t=0.19 14:55:52

. **************************************************************************
. *robust estimation by specifying p-weights 
. intreg lhw_lower lhw_upper (b2.skilllevel)##(c.zpalter##c.zpalter) b13.occupational_categories index_afl_1 - index_afl_4 njc sjc pcuse [pw=gew] if cond==1, het(c.zpalter##c.zpalter b2.skill
> level index_afl_1 - index_afl_4 njc sjc pcuse)   

Fitting full model:

Iteration 0:   log pseudolikelihood = -31123.092  
Iteration 1:   log pseudolikelihood =  -24524.52  
Iteration 2:   log pseudolikelihood = -24322.093  
Iteration 3:   log pseudolikelihood = -24311.348  
Iteration 4:   log pseudolikelihood = -24311.326  
Iteration 5:   log pseudolikelihood = -24311.326  

Interval regression                               Number of obs   =       6853
                                                  Wald chi2(34)   =    1797.23
Log pseudolikelihood = -24311.326                 Prob > chi2     =     0.0000

------------------------------------------------------------------------------------------------
                               |               Robust
                               |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------------------------+----------------------------------------------------------------
model                          |
                    skilllevel |
                            1  |  -.0874084    .351207    -0.25   0.803    -.7757615    .6009447
                            3  |  -1.436048   .4027106    -3.57   0.000    -2.225346   -.6467495
                               |
                       zpalter |   .0314144   .0057827     5.43   0.000     .0200806    .0427483
                               |
           c.zpalter#c.zpalter |  -.0003029   .0000724    -4.19   0.000    -.0004448   -.0001611
                               |
          skilllevel#c.zpalter |
                            1  |  -.0016372   .0183078    -0.09   0.929    -.0375199    .0342455
                            3  |   .0678067    .020268     3.35   0.001     .0280821    .1075313
                               |
skilllevel#c.zpalter#c.zpalter |
                            1  |    .000077   .0002302     0.33   0.738    -.0003743    .0005283
                            3  |  -.0007156   .0002486    -2.88   0.004    -.0012028   -.0002283
                               |
       occupational_categories |
                            1  |  -.2682709   .0603781    -4.44   0.000    -.3866098   -.1499319
                            2  |   .0097279   .0621812     0.16   0.876    -.1121449    .1316008
                            3  |   .1438928   .0392171     3.67   0.000     .0670286     .220757
                            4  |   .1242706   .0367737     3.38   0.001     .0521956    .1963457
                            5  |   .1040353   .0296684     3.51   0.000     .0458863    .1621843
                            6  |   .0511985   .0229874     2.23   0.026     .0061441     .096253
                            7  |   .0174866    .027464     0.64   0.524    -.0363419    .0713151
                            8  |  -.1406284   .0835459    -1.68   0.092    -.3043753    .0231184
                            9  |  -.1046044   .0321881    -3.25   0.001    -.1676919   -.0415169
                           10  |  -.0273838    .027668    -0.99   0.322    -.0816121    .0268444
                           11  |  -.0264563   .0331597    -0.80   0.425    -.0914481    .0385356
                           12  |  -.0842952   .0433144    -1.95   0.052    -.1691899    .0005996
                           14  |   .1643176   .0303577     5.41   0.000     .1048176    .2238177
                           15  |   .0971267   .0246229     3.94   0.000     .0488668    .1453866
                           16  |  -.0821079   .0301818    -2.72   0.007    -.1412631   -.0229526
                           17  |   .1040512   .0300456     3.46   0.001     .0451629    .1629395
                           18  |  -.0714071   .0274704    -2.60   0.009     -.125248   -.0175662
                           19  |   .0789254   .0251728     3.14   0.002     .0295876    .1282633
                           20  |   .0060188   .0245477     0.25   0.806    -.0420937    .0541313
                               |
                   index_afl_1 |   .2251988    .030375     7.41   0.000     .1656649    .2847326
                   index_afl_2 |   .1642659   .0214229     7.67   0.000     .1222778     .206254
                   index_afl_3 |   .0900679   .0259962     3.46   0.001     .0391162    .1410195
                   index_afl_4 |   .0928299   .0221239     4.20   0.000     .0494679    .1361919
                           njc |   .0093196   .0025171     3.70   0.000     .0043861     .014253
                           sjc |   .0199288   .0034597     5.76   0.000     .0131479    .0267097
                         pcuse |    .129409   .0110691    11.69   0.000      .107714     .151104
                         _cons |   1.484775   .1138326    13.04   0.000     1.261667    1.707882
-------------------------------+----------------------------------------------------------------
lnsigma                        |
                       zpalter |   .0128614   .0157984     0.81   0.416    -.0181029    .0438257
                               |
           c.zpalter#c.zpalter |  -.0001236   .0001991    -0.62   0.535    -.0005138    .0002667
                               |
                    skilllevel |
                            1  |   .0203227   .0473027     0.43   0.667    -.0723889    .1130344
                            3  |   .1021674   .0559807     1.83   0.068    -.0075527    .2118876
                               |
                   index_afl_1 |   .0531883   .0968551     0.55   0.583    -.1366442    .2430209
                   index_afl_2 |   .0326051   .0617608     0.53   0.598    -.0884439    .1536541
                   index_afl_3 |   -.113175   .0766545    -1.48   0.140     -.263415     .037065
                   index_afl_4 |    .001849   .0643101     0.03   0.977    -.1241964    .1278945
                           njc |   .0008869    .007284     0.12   0.903    -.0133896    .0151634
                           sjc |   .0171545   .0109342     1.57   0.117     -.004276    .0385851
                         pcuse |  -.0810967    .029689    -2.73   0.006     -.139286   -.0229074
                         _cons |   -1.39742   .3032006    -4.61   0.000    -1.991682   -.8031579
------------------------------------------------------------------------------------------------

  Observation summary:        10  left-censored observations
                               0     uncensored observations
                               0 right-censored observations
                            6843       interval observations
r; t=6.90 14:55:59

. 
end of do-file
r; t=13.40 14:55:59

. do $git\BIBB2006_load_model.do

. * coding: utf-8
. * Author:        Henry Webel, HU Berlin, Master Statistics
. * Reference: 
. * Supervisors: Bernd Fitzenberger, Marina Furdas
. ****************************************************************************************************
. capture log close
